[{"title":"Ulysses","author":"James Joyce","description":"Ulysseshas been the subject of controversy since copies of the first English edition were burned by the New York Post Office Authorities. Today critical interest centers on the authority of the text. This edition republishes, for the first time, without interference, the original 1922 text. Jeri Johnson's critical Introduction demystifies the complexities of the book, and a full textual publication history, helpful appendices, and explanatory notes guide the reader through this highly allusive text.","publisher":"Unknown","publish_date":"2024-02-23","pages":1060,"language_written":"en","img_url":"http://books.google.com/books/content?id=WVofz29Hx9UC\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026edge=curl\u0026source=gbs_api","isbn_13":"9780192834645","google_books_id":"WVofz29Hx9UC","genre":"Fiction","rating":4},{"title":"F. Scott Fitzgerald: The Great Gatsby","author":"F. Scott Fitzgerald","description":"Classical portrayal of love and violence during the Twenties.","publisher":"Cambridge University Press","publish_date":"1991-08-30","pages":288,"language_written":"en","img_url":"http://books.google.com/books/content?id=0yfauGsKOjAC\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026edge=curl\u0026source=gbs_api","isbn_13":"9780521402309","google_books_id":"0yfauGsKOjAC","genre":"Fiction","rating":4},{"title":"One Hundred Years of Solitude","author":"Gabriel García Márquez","description":"Netflix’s series adaptation of One Hundred Years of Solitude premieres December 11, 2024! One of the twentieth century’s enduring works, One Hundred Years of Solitude is a widely beloved and acclaimed novel known throughout the world and the ultimate achievement in a Nobel Prize–winning career. The novel tells the story of the rise and fall of the mythical town of Macondo through the history of the Buendía family. Rich and brilliant, it is a chronicle of life, death, and the tragicomedy of humankind. In the beautiful, ridiculous, and tawdry story of the Buendía family, one sees all of humanity, just as in the history, myths, growth, and decay of Macondo, one sees all of Latin America. Love and lust, war and revolution, riches and poverty, youth and senility, the variety of life, the endlessness of death, the search for peace and truth—these universal themes dominate the novel. Alternately reverential and comical, One Hundred Years of Solitude weaves the political, personal, and spiritual to bring a new consciousness to storytelling. Translated into dozens of languages, this stunning work is no less than an account of the history of the human race.","publisher":"Blackstone Publishing","publish_date":"2022-10-11","pages":342,"language_written":"en","img_url":"http://books.google.com/books/content?id=AfB8EAAAQBAJ\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026edge=curl\u0026source=gbs_api","isbn_13":"9798200952090","google_books_id":"AfB8EAAAQBAJ","genre":"Fiction","rating":"No rating available"},{"title":"Herman Melville's Moby-Dick","author":"Harold Bloom","description":"Herman Melville was already considered to be a successful author when he wrote Moby-Dick in just under two years. Yet despite his earlier success, the novel was widely misunderstood by its 19th-century readers, who expected a more traditional adventure novel. Today Moby-Dick is considered to be an undisputed classic, and many believe it to be the epitome of the great American novel. With an unforgettable cast of characters, inluding the mad Captain Ahab, Melville skillfully documents the Pequod crew's tragic hunt for the great white whale. The full-length essays presented in Herman Melville's Moby Dick, Updated Edition provide expert commentary on the huge canvas of symbols themes, and subjects presented in this novel, as well as an introduction, a chronology, a bibliography, and an index, that will help students navigate confidently through Melville's masterpiece.","publisher":"Infobase Publishing","publish_date":"2002-12-31","pages":255,"language_written":"en","img_url":"http://books.google.com/books/content?id=U4eStWzD49UC\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026edge=curl\u0026source=gbs_api","isbn_13":"9780791093634","google_books_id":"U4eStWzD49UC","genre":"Mer - Récits américains - Histoire et critique","rating":"No rating available"},{"title":"War and Peace","author":"Leo Tolstoi","description":"Widely regarded as the greatest novel in any language, War and Peace is primarily concerned with the histories of five aristocratic families--particularly the Bezukhovs, the Bolkonskys, and the Rostovs--the members of which are portrayed against a vivid background of Russian social life during the war against Napoleon (1805-14). The theme of war, however, is subordinate to the story of family existence, which involves Tolstoy's optimistic belief in the life-asserting pattern of human existence. The heroine, Natasha Rostova, for example, reaches her greatest fulfilment through her marriage to Pierre Bezukhov and her motherhood. The novel also sets forth a theory of history, concluding that there is a minimum of free choice; all is ruled by an inexorable historical determinism","publisher":"Collector's Library","publish_date":"2010-06-01","pages":1662,"language_written":"en","img_url":"http://books.google.com/books/content?id=s-OQ2yHDIMQC\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026edge=curl\u0026source=gbs_api","isbn_13":"9781904633853","google_books_id":"s-OQ2yHDIMQC","genre":"Fiction","rating":4.5},{"title":"Pride and Prejudice","author":"Jane Austen","description":"Austen’s most celebrated novel tells the story of Elizabeth Bennet, a bright, lively young woman with four sisters, and a mother determined to marry them to wealthy men. At a party near the Bennets’ home in the English countryside, Elizabeth meets the wealthy, proud Fitzwilliam Darcy. Elizabeth initially finds Darcy haughty and intolerable, but circumstances continue to unite the pair. Mr. Darcy finds himself captivated by Elizabeth’s wit and candor, while her reservations about his character slowly vanish. The story is as much a social critique as it is a love story, and the prose crackles with Austen’s wry wit.","publisher":"Unknown","publish_date":"2024-06-04","pages":448,"language_written":"en","img_url":"http://books.google.com/books/content?id=s1gVAAAAYAAJ\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026edge=curl\u0026source=gbs_api","isbn_13":"9781853260001","google_books_id":"s1gVAAAAYAAJ","genre":"Courtship","rating":4},{"title":"1984","author":"George Orwell","description":"A PBS Great American Read Top 100 Pick With extraordinary relevance and renewed popularity, George Orwell’s 1984 takes on new life in this edition. “Orwell saw, to his credit, that the act of falsifying reality is only secondarily a way of changing perceptions. It is, above all, a way of asserting power.”—The New Yorker In 1984, London is a grim city in the totalitarian state of Oceania where Big Brother is always watching you and the Thought Police can practically read your mind. Winston Smith is a man in grave danger for the simple reason that his memory still functions. Drawn into a forbidden love affair, Winston finds the courage to join a secret revolutionary organization called The Brotherhood, dedicated to the destruction of the Party. Together with his beloved Julia, he hazards his life in a deadly match against the powers that be. Lionel Trilling said of Orwell’s masterpiece, “1984 is a profound, terrifying, and wholly fascinating book. It is a fantasy of the political future, and like any such fantasy, serves its author as a magnifying device for an examination of the present.” Though the year 1984 now exists in the past, Orwell’s novel remains an urgent call for the individual willing to speak truth to power.","publisher":"HarperCollins","publish_date":"2013-09-03","pages":309,"language_written":"en","img_url":"http://books.google.com/books/content?id=kotPYEqx7kMC\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026edge=curl\u0026source=gbs_api","isbn_13":"9780547249643","google_books_id":"kotPYEqx7kMC","genre":"Fiction","rating":4.5},{"title":"The Lord Of The Rings","author":"J.R.R. Tolkien","description":"Immerse yourself in Middle-earth with J.R.R. Tolkien’s classic masterpieces behind the films... This special 50th anniversary edition includes three volumes of The Lord of the Rings (The Fellowship of the Ring, The Two Towers, and The Return of the King), along with an extensive new index—a must-own tome for old and new Tolkien readers alike. One Ring to rule them all, One Ring to find them, One Ring to bring them all and in the darkness bind them. In ancient times the Rings of Power were crafted by the Elven-smiths, and Sauron, the Dark Lord, forged the One Ring, filling it with his own power so that he could rule all others. But the One Ring was taken from him, and though he sought it throughout Middle-earth, it remained lost to him. After many ages it fell by chance into the hands of the hobbit Bilbo Baggins. From Sauron's fastness in the Dark Tower of Mordor, his power spread far and wide. Sauron gathered all the Great Rings to him, but always he searched for the One Ring that would complete his dominion. When Bilbo reached his eleventy-first birthday he disappeared, bequeathing to his young cousin Frodo the Ruling Ring and a perilous quest: to journey across Middle-earth, deep into the shadow of the Dark Lord, and destroy the Ring by casting it into the Cracks of Doom. The Lord of the Rings tells of the great quest undertaken by Frodo and the Fellowship of the Ring: Gandalf the Wizard; the hobbits Merry, Pippin, and Sam; Gimli the Dwarf; Legolas the Elf; Boromir of Gondor; and a tall, mysterious stranger called Strider. J.R.R. Tolkien (1892-1973), beloved throughout the world as the creator of The Hobbit, The Lord of the Rings, and The Silmarillion, was a professor of Anglo-Saxon at Oxford, a fellow of Pembroke College, and a fellow of Merton College until his retirement in 1959. His chief interest was the linguistic aspects of the early English written tradition, but while he studied classic works of the past, he was creating a set of his own.","publisher":"HarperCollins","publish_date":"2012-02-15","pages":1267,"language_written":"en","img_url":"http://books.google.com/books/content?id=yl4dILkcqm4C\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026edge=curl\u0026source=gbs_api","isbn_13":"9780547951942","google_books_id":"yl4dILkcqm4C","genre":"Fiction","rating":4.5},{"title":"The Odyssey of Homer","author":"Richmond Lattimore","description":"Homer’s great epic The Odyssey—one of Western literature’s most enduring and important works—translated by Richmond Lattimore A classic for the ages, The Odyssey recounts Odysseus’ journey home after the Trojan War—and the obstacles he faces along the way to reclaim his throne, kingdom, and family in Ithaca. During his absence, his steadfast and clever wife, Penelope, and now teenaged son, Telemachus, have lived under the constant threat of ruthless suitors, all desperate to court Penelope and claim the throne. As the suitors plot Telemachus’ murder, the gods debate Odysseus’ fate. With help from the goddess Athena, the scattered family bides their time as Odysseus battles his way through storm and shipwreck, the cave of the Cyclops, the isle of witch-goddess Circe, the deadly Sirens’ song, a trek through the Underworld, and the omnipresent wrath of the scorned god Poseidon. An American poet and classicist, Richmond Lattimore’s translation of The Odyssey is widely considered among the best available in the English language. Lattimore breathes modern life into Homer’s epic, bringing this classic work of heroes, monsters, vengeful gods, treachery, and redemption to life for modern readers.","publisher":"Harper Collins","publish_date":"2009-03-17","pages":715,"language_written":"en","img_url":"http://books.google.com/books/content?id=OT7MUVjJ82wC\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026edge=curl\u0026source=gbs_api","isbn_13":"9780061760204","google_books_id":"OT7MUVjJ82wC","genre":"Fiction","rating":"No rating available"},{"title":"Crime and Punishment","author":"Fyodor Dostoyevsky","description":"Crime and Punishment is the story of a murder committed on principle, of a killer who wishes to set himself outside and above society. It is marked by Dostoevsky's own harrowing experience, and yet there are moments of wild humour. This authoritative translation comes with a challenging new introduction and helpful annotation.","publisher":"Oxford University Press","publish_date":"2012-08-08","pages":545,"language_written":"en","img_url":"http://books.google.com/books/content?id=hlExDwAAQBAJ\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026edge=curl\u0026source=gbs_api","isbn_13":"9780198709701","google_books_id":"hlExDwAAQBAJ","genre":"Fiction","rating":5},{"title":"The Brothers Karamazov","author":"Fyodor Dostoevsky","description":"Winner of the Pen/Book-of-the-Month Club Translation Prize The award-winning translation of Fyodor Dostoevsky's classic novel of psychological realism. The Brothers Karamazov is a murder mystery, a courtroom drama, and an exploration of erotic rivalry in a series of triangular love affairs involving the “wicked and sentimental” Fyodor Pavlovich Karamazov and his three sons—the impulsive and sensual Dmitri; the coldly rational Ivan; and the healthy, red-cheeked young novice Alyosha. Through the gripping events of their story, Dostoevsky portrays the whole of Russian life, is social and spiritual striving, in what was both the golden age and a tragic turning point in Russian culture. This award-winning translation by Richard Pevear and Larissa Volokhonsky remains true to the verbal inventiveness of Dostoevsky’s prose, preserving the multiple voices, the humor, and the surprising modernity of the original. It is an achievement worthy of Dostoevsky’s last and greatest novel.","publisher":"North Point Press","publish_date":"2002-06-14","pages":826,"language_written":"en","img_url":"http://books.google.com/books/content?id=OG0e6djUgUYC\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026edge=curl\u0026source=gbs_api","isbn_13":"9781429927215","google_books_id":"OG0e6djUgUYC","genre":"Fiction","rating":"No rating available"},{"title":"Don Quixote","author":"Miguel De Cervantes Saavedra","description":"Don Quixote has become so entranced reading tales of chivalry that he decides to turn knight errant himself. In the company of his faithful squire, Sancho Panza, these exploits blossom in all sorts of wonderful ways. While Quixote's fancy often leads him astray—he tilts at windmills, imagining them to be giants—Sancho acquires cunning and a certain sagacity. Sane madman and wise fool, they roam the world together-and together they have haunted readers' imaginations for nearly four hundred years. With its experimental form and literary playfulness, Don Quixote has been generally recognized as the first modern novel. This Penguin Classics edition, with its beautiful new cover design, includes John Rutherford's masterly translation, which does full justice to the energy and wit of Cervantes's prose, as well as a brilliant critical introduction by Roberto Gonzalez Echevarriá.","publisher":"Penguin","publish_date":"2003-02-25","pages":1076,"language_written":"en","img_url":"http://books.google.com/books/content?id=Av8JsvFbeRwC\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026edge=curl\u0026source=gbs_api","isbn_13":"9781440673016","google_books_id":"Av8JsvFbeRwC","genre":"Fiction","rating":"No rating available"},{"title":"The Divine Comedy","author":"Dante Alighieri","description":"Journey through Inferno, Purgatorio, and Paradiso in this stunning gift edition of Dante's epic poems. The next elegant edition in the Knickerbocker Classic series, The Divine Comedy is unabridged and complete, and comprised of all three sections of this epic trilogy by Dante Alighieri: Inferno, Purgatorio, and Paradiso. For Dante fans worldwide, this stunning gift edition has a cloth binding, ribbon marker, and is packaged neatly in an elegant slipcase. Featuring a new introduction, the classic translation by the poet Henry Wadsworth Longfellow (1807-1882), and over one hundred engravings by Gustave Dore, this volume of The Divine Comedy is an indispensable classic for every home library.","publisher":"Race Point Publishing","publish_date":"2015-09-21","pages":738,"language_written":"en","img_url":"http://books.google.com/books/content?id=1f36CwAAQBAJ\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026edge=curl\u0026source=gbs_api","isbn_13":"9781631061561","google_books_id":"1f36CwAAQBAJ","genre":"Fiction","rating":"No rating available"},{"title":"The Iliad of Homer","author":"Homer","description":"\"Sing, goddess, the anger of Peleus’ son Achilleus / and its devastation.\" For sixty years, that's how Homer has begun the Iliad in English, in Richmond Lattimore's faithful translation—the gold standard for generations of students and general readers. This long-awaited new edition of Lattimore's Iliad is designed to bring the book into the twenty-first century—while leaving the poem as firmly rooted in ancient Greece as ever. Lattimore's elegant, fluent verses—with their memorably phrased heroic epithets and remarkable fidelity to the Greek—remain unchanged, but classicist Richard Martin has added a wealth of supplementary materials designed to aid new generations of readers. A new introduction sets the poem in the wider context of Greek life, warfare, society, and poetry, while line-by-line notes at the back of the volume offer explanations of unfamiliar terms, information about the Greek gods and heroes, and literary appreciation. A glossary and maps round out the book. The result is a volume that actively invites readers into Homer's poem, helping them to understand fully the worlds in which he and his heroes lived—and thus enabling them to marvel, as so many have for centuries, at Hektor and Ajax, Paris and Helen, and the devastating rage of Achilleus.","publisher":"University of Chicago Press","publish_date":"2011-09-19","pages":607,"language_written":"en","img_url":"http://books.google.com/books/content?id=VppP9t9CjFIC\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026edge=curl\u0026source=gbs_api","isbn_13":"9780226470382","google_books_id":"VppP9t9CjFIC","genre":"Poetry","rating":4},{"title":"The Catcher in the Rye","author":"J. D. Salinger","description":"The \"brilliant, funny, meaningful novel\" (The New Yorker) that established J. D. Salinger as a leading voice in American literature--and that has instilled in millions of readers around the world a lifelong love of books. \"If you really want to hear about it, the first thing you'll probably want to know is where I was born, and what my lousy childhood was like, and how my parents were occupied and all before they had me, and all that David Copperfield kind of crap, but I don't feel like going into it, if you want to know the truth.\" The hero-narrator of The Catcher in the Rye is an ancient child of sixteen, a native New Yorker named Holden Caufield. Through circumstances that tend to preclude adult, secondhand description, he leaves his prep school in Pennsylvania and goes underground in New York City for three days.","publisher":"Little, Brown","publish_date":"2019-08-13","pages":204,"language_written":"en","img_url":"http://books.google.com/books/content?id=FqSiDwAAQBAJ\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026edge=curl\u0026source=gbs_api","isbn_13":"9780316460002","google_books_id":"FqSiDwAAQBAJ","genre":"Fiction","rating":5},{"title":"The Bible:","author":"Rev. Dr. Kunjumon Daniel","description":"There's no available information at this time. Author will provide once information is available.","publisher":"Xlibris Corporation","publish_date":"2021-08-10","pages":153,"language_written":"en","img_url":"http://books.google.com/books/content?id=_FI-EAAAQBAJ\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026edge=curl\u0026source=gbs_api","isbn_13":"9781664189164","google_books_id":"_FI-EAAAQBAJ","genre":"Religion","rating":"No rating available"},{"title":"The Canterbury Tales","author":"Geoffrey Chaucer","description":"Nevill Coghill’s masterly and vivid modern English verse translation with all the vigor and poetry of Chaucer’s fourteenth-century Middle English A Penguin Classic In The Canterbury Tales Chaucer created one of the great touchstones of English literature, a masterly collection of chivalric romances, moral allegories and low farce. A story-telling competition between a group of pilgrims from all walks of life is the occasion for a series of tales that range from the Knight’s account of courtly love and the ebullient Wife of Bath’s Arthurian legend, to the ribald anecdotes of the Miller and the Cook. Rich and diverse, The Canterbury Tales offer us an unrivalled glimpse into the life and mind of medieval England. For more than sixty-five years, Penguin has been the leading publisher of classic literature in the English-speaking world. With more than 1,500 titles, Penguin Classics represents a global bookshelf of the best works throughout history and across genres and disciplines. Readers trust the series to provide authoritative texts enhanced by introductions and notes by distinguished scholars and contemporary authors, as well as up-to-date translations by award-winning translators.","publisher":"Penguin","publish_date":"2003-02-04","pages":532,"language_written":"en","img_url":"http://books.google.com/books/content?id=Ek_-lNfzGUcC\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026edge=curl\u0026source=gbs_api","isbn_13":"9780140424386","google_books_id":"Ek_-lNfzGUcC","genre":"Poetry","rating":4},{"title":"The Adventures of Huckleberry Finn","author":"Mark Twain","description":"Huckleberry Finn, an abused outcast, rafts with Jim, a runaway slave, down the Mississippi River, where they have a variety of experiences.","publisher":"Collector's Library","publish_date":"2020-03-01","pages":372,"language_written":"en","img_url":"http://books.google.com/books/content?id=s9q60rLUbRcC\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026edge=curl\u0026source=gbs_api","isbn_13":"9781904633464","google_books_id":"s9q60rLUbRcC","genre":"Fiction","rating":"No rating available"},{"title":"The Grapes of Wrath","author":"John Steinbeck","description":"The Pulitzer Prize-winning epic of the Great Depression, a book that galvanized—and sometimes outraged—millions of readers. Nominated as one of America’s best-loved novels by PBS’s The Great American Read A Penguin Classic First published in 1939, Steinbeck’s Pulitzer Prize-winning epic of the Great Depression chronicles the Dust Bowl migration of the 1930s and tells the story of one Oklahoma farm family, the Joads—driven from their homestead and forced to travel west to the promised land of California. Out of their trials and their repeated collisions against the hard realities of an America divided into Haves and Have-Nots evolves a drama that is intensely human yet majestic in its scale and moral vision, elemental yet plainspoken, tragic but ultimately stirring in its human dignity. A portrait of the conflict between the powerful and the powerless, of one man’s fierce reaction to injustice, and of one woman’s stoical strength, the novel captures the horrors of the Great Depression and probes into the very nature of equality and justice in America. At once a naturalistic epic, captivity narrative, road novel, and transcendental gospel, Steinbeck’s powerful landmark novel is perhaps the most American of American Classics. This Penguin Classics edition contains an introduction and notes by Steinbeck scholar Robert Demott. For more than seventy years, Penguin has been the leading publisher of classic literature in the English-speaking world. With more than 1,800 titles, Penguin Classics represents a global bookshelf of the best works throughout history and across genres and disciplines. Readers trust the series to provide authoritative texts enhanced by introductions and notes by distinguished scholars and contemporary authors, as well as up-to-date translations by award-winning translators.","publisher":"Penguin","publish_date":"2006-03-28","pages":532,"language_written":"en","img_url":"http://books.google.com/books/content?id=bhJgd3hGdxQC\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026edge=curl\u0026source=gbs_api","isbn_13":"9780143039433","google_books_id":"bhJgd3hGdxQC","genre":"Fiction","rating":5},{"title":"Brave New World","author":"Aldous Huxley","description":"Set far in the future, Aldous Huxley’s Brave New World depicts a world where “Controllers” have achieved what they believe to be the ideal society. Through scientific and genetic breakthroughs the human race has been brought to perfection: humans have pre-assigned roles in society, and everyone happily fulfills their purpose. Bernard Marx, however, is different. He is disgusted by the predestined behaviour of his peers and has a strong desire to break free from social pressures, leading him to set off on a journey to visit one of the few remaining Savage Reservations—places where the old, flawed, and imperfect life still continues. Inspired by the popularity of utopian novels at the time Aldous Huxley created a dystopian vision of what our world might one day become—and readers will be terrified to discover that some of his predictions may have already come true. Brave New World has twice been adapted for film, most recently in 1998 as a television movie starring Peter Gallagher and Leonard Nimoy. HarperPerennial Classics brings great works of literature to life in digital format, upholding the highest standards in ebook production and celebrating reading in all its forms. Look for more titles in the HarperPerennial Classics collection to build your digital library.","publisher":"Harper Collins","publish_date":"2014-01-01","pages":250,"language_written":"en","img_url":"http://books.google.com/books/content?id=hRTtAQAAQBAJ\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026edge=curl\u0026source=gbs_api","isbn_13":"9781443432351","google_books_id":"hRTtAQAAQBAJ","genre":"Fiction","rating":"No rating available"},{"title":"The Stranger","author":"Albert Camus","description":"With the intrigue of a psychological thriller, The Stranger—Camus's masterpiece—gives us the story of an ordinary man unwittingly drawn into a senseless murder on an Algerian beach. With an Introduction by Peter Dunwoodie; translated by Matthew Ward. Behind the subterfuge, Camus explores what he termed \"the nakedness of man faced with the absurd\" and describes the condition of reckless alienation and spiritual exhaustion that characterized so much of twentieth-century life. “The Stranger is a strikingly modern text and Matthew Ward’s translation will enable readers to appreciate why Camus’s stoical anti-hero and ­devious narrator remains one of the key expressions of a postwar Western malaise, and one of the cleverest exponents of a literature of ambiguity.” –from the Introduction by Peter Dunwoodie First published in 1946; now in translation by Matthew Ward.","publisher":"Vintage","publish_date":"1989-03-13","pages":134,"language_written":"en","img_url":"http://books.google.com/books/content?id=iVV7bKVUNBAC\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026edge=curl\u0026source=gbs_api","isbn_13":"9780679720201","google_books_id":"iVV7bKVUNBAC","genre":"Fiction","rating":4},{"title":"The Trial","author":"Franz Kafka","description":"In this masterful translation by David Wyllie which is true to the original, the Czech-German writer Franz Kafka (1883 - 1924) shows us why he has had such a profound and lasting influence on literature for over a hundred years. Although much of his work was technically unfinished at the time of his death, he now stands as one of the great novelists of modern fiction. THE TRIAL is Franz Kafka's masterpiece, first published in 1925. Kafka's best-known work, it tells the story of a man arrested and prosecuted by a remote, inaccessible authority, with the nature of his crime revealed neither to him nor to the reader. This brilliant cautionary tale can also be read as a clever indictment of the stupidity and corruption of the legal system and government bureaucracy.","publisher":"Unknown","publish_date":"2016-07-21","pages":124,"language_written":"en","img_url":"http://books.google.com/books/content?id=81LuvQAACAAJ\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026source=gbs_api","isbn_13":"9781773230078","google_books_id":"81LuvQAACAAJ","genre":"Fiction","rating":"No rating available"},{"title":"Lolita","author":"Vladimir Nabokov","description":"The most famous and controversial novel from one of the greatest writers of the twentieth century tells the story of Humbert Humbert’s obsessive, devouring, and doomed passion for the nymphet Dolores Haze. “The conjunction of a sense of humor with a sense of horror [results in] satire of a very special kind.”—The New Yorker One of The Atlantic’s Great American Novels of the Past 100 Years Awe and exhilaration—along with heartbreak and mordant wit—abound in Lolita, which tells the story of the aging Humbert Humbert's obsession for the nymphet Dolores Haze. Lolita is also the story of a hypercivilized European colliding with the cheerful barbarism of postwar America. Most of all, it is a meditation on love—love as outrage and hallucination, madness and transformation.","publisher":"Vintage","publish_date":"1989-03-13","pages":338,"language_written":"en","img_url":"http://books.google.com/books/content?id=WfCKDQAAQBAJ\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026edge=curl\u0026source=gbs_api","isbn_13":"9780679723165","google_books_id":"WfCKDQAAQBAJ","genre":"Fiction","rating":"No rating available"},{"title":"Middlemarch","author":"George Eliot","description":"This is an analysis of the life of an English provincial town during the time of social unrest prior to the first Reform Bill of 1832. It is told through the lives of Dorothea Brooke and Dr Tertius Lydgate and includes a host of characters who illuminate the condition of English life in the mid 19th century.","publisher":"Wordsworth Editions","publish_date":"2017-01-06","pages":740,"language_written":"en","img_url":"http://books.google.com/books/content?id=iPLjUhiXAhYC\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026edge=curl\u0026source=gbs_api","isbn_13":"9781853262371","google_books_id":"iPLjUhiXAhYC","genre":"Fiction","rating":5},{"title":"The Sound and the Fury","author":"William Faulkner","description":"DigiCat Publishing presents to you this special edition of \"The Sound and the Fury\" by William Faulkner. DigiCat Publishing considers every written word to be a legacy of humankind. Every DigiCat book has been carefully reproduced for republishing in a new modern format. The books are available in print, as well as ebooks. DigiCat hopes you will treat this work with the acknowledgment and passion it deserves as a classic of world literature.","publisher":"DigiCat","publish_date":"2022-08-01","pages":254,"language_written":"en","img_url":"http://books.google.com/books/content?id=iHx_EAAAQBAJ\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026edge=curl\u0026source=gbs_api","isbn_13":"9780330306522","google_books_id":"iHx_EAAAQBAJ","genre":"Fiction","rating":"No rating available"},{"title":"The Picture of Dorian Gray","author":"Oscar Wilde","description":"Spellbound before his own portrait, Dorian Gray utters a fateful wish. In exchange for eternal youth he gives his soul, to be corrupted by the malign influence of his mentor, the aesthete and hedonist Lord Henry Wotton.","publisher":"Oxford University Press, USA","publish_date":"2006-10-12","pages":268,"language_written":"en","img_url":"http://books.google.com/books/content?id=iOheSL_H3hEC\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026source=gbs_api","isbn_13":"9780192815538","google_books_id":"iOheSL_H3hEC","genre":"Fiction","rating":"No rating available"},{"title":"The old man and the sea","author":"Ernest Hemingway","description":"No description available","publisher":"Hueber Verlag","publish_date":"1996-06-10","pages":68,"language_written":"en","img_url":"http://books.google.com/books/content?id=K1cIZmFe7KoC\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026edge=curl\u0026source=gbs_api","isbn_13":"9783190001507","google_books_id":"K1cIZmFe7KoC","genre":"Fiction","rating":4},{"title":"The Sun Also Rises","author":"Ernest Hemingway","description":"The illustrated edition of Ernest Hemingway's first novel. The Sun Also Rises is a 1926 novel by American writer Ernest Hemingway, his first, that portrays American and British expatriates who travel from Paris to the Festival of San Fermín in Pamplona to watch the running of the bulls and the bullfights. An early and enduring modernist novel, it received mixed reviews upon publication. However, Hemingway biographer Jeffrey Meyers writes that it is now \"recognized as Hemingway's greatest work\", and Hemingway scholar Linda Wagner-Martin calls it his most important novel. The novel was published in the United States in October 1926 by Scribner's. A year later, Jonathan Cape published the novel in London under the title Fiesta. It remains in print. The novel is a roman à clef: the characters are based on real people in Hemingway's circle, and the action is based on real events, particularly Hemingway's life in Paris in the 1920s and a trip to Spain in 1925 for the Pamplona festival and fishing in the Pyrenees. Hemingway presents his notion that the \"Lost Generation\"-considered to have been decadent, dissolute, and irretrievably damaged by World War I-was in fact resilient and strong. Hemingway investigates the themes of love and death, the revivifying power of nature, and the concept of masculinity. His spare writing style, combined with his restrained use of description to convey characterizations and action, demonstrates his \"Iceberg Theory\" of writing. Plot summary On the surface, the novel is a love story between the protagonist Jake Barnes-a man whose war wound has made him unable to have sex-and the promiscuous divorcée Lady Brett Ashley. Jake is an expatriate American journalist living in Paris, while Brett is a twice-divorced Englishwoman with bobbed hair and numerous love affairs, and embodies the new sexual freedom of the 1920s. Brett's affair with Jake's college friend Robert Cohn causes Jake to be upset and break off his friendship with Robert; her seduction of the 19-year-old matador Romero causes Jake to lose his good reputation among the Spaniards in Pamplona. Book One is set in the café society of young American expatriates in Paris. In the opening scenes, Jake plays tennis with Robert, picks up a prostitute (Georgette), and runs into Brett and Count Mippipopolous in a nightclub. Later, Brett tells Jake she loves him, but they both know that they have no chance at a stable relationship. In Book Two, Jake is joined by Bill Gorton, recently arrived from New York, and Brett's fiancé Mike Campbell, who arrives from Scotland. Jake and Bill travel south and meet Robert at Bayonne for a fishing trip in the hills northeast of Pamplona. Instead of fishing, Robert stays in Pamplona to wait for the overdue Brett and Mike. Robert had an affair with Brett a few weeks earlier and still feels possessive of her despite her engagement to Mike. After Jake and Bill enjoy five days of fishing the streams near Burguete, they rejoin the group in Pamplona. All begin to drink heavily. Robert is resented by the others, who taunt him with antisemitic remarks. During the fiesta the characters drink, eat, watch the running of the bulls, attend bullfights, and bicker with each other. Jake introduces Brett to the 19-year-old matador Romero at the Hotel Montoya; she is smitten with him and seduces him.","publisher":"E-Kitap Projesi \u0026 Cheapest Books","publish_date":"2023-12-04","pages":287,"language_written":"en","img_url":"http://books.google.com/books/content?id=uXnlEAAAQBAJ\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026edge=curl\u0026source=gbs_api","isbn_13":"9786257287784","google_books_id":"uXnlEAAAQBAJ","genre":"Fiction","rating":"No rating available"},{"title":"The Road","author":"Cormac McCarthy","description":"In a novel set in an indefinite, futuristic, post-apocalyptic world, a father and his young son make their way through the ruins of a devastated American landscape, struggling to survive and preserve the last remnants of their own humanity","publisher":"Vintage Books","publish_date":"2016-11-09","pages":297,"language_written":"en","img_url":"http://books.google.com/books/content?id=owFWa3p5h28C\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026edge=curl\u0026source=gbs_api","isbn_13":"9780307386458","google_books_id":"owFWa3p5h28C","genre":"Fiction","rating":3.5},{"title":"Beloved","author":"Toni Morrison","description":"PULITZER PRIZE WINNER • NEW YORK TIMES BESTSELLER • A spellbinding novel that transforms history into a story as powerful as Exodus and as intimate as a lullaby. With a new afterword by the author. This \"brutally powerful, mesmerizing story” (People) is an unflinchingly look into the abyss of slavery, from the acclaimed Nobel Prize winner. Sethe was born a slave and escaped to Ohio, but eighteen years later she is still not free. Sethe has too many memories of Sweet Home, the beautiful farm where so many hideous things happened. And Sethe’s new home is haunted by the ghost of her baby, who died nameless and whose tombstone is engraved with a single word: Beloved. “A masterwork.... Wonderful.... I can’t imagine American literature without it.” —John Leonard, Los Angeles Times","publisher":"Vintage","publish_date":"2007-07-24","pages":354,"language_written":"en","img_url":"http://books.google.com/books/content?id=sfmp6gjZGP8C\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026edge=curl\u0026source=gbs_api","isbn_13":"9780307388629","google_books_id":"sfmp6gjZGP8C","genre":"Fiction","rating":3},{"title":"The Hobbit, Or, There and Back Again [4]","author":"John Ronald Reuel Tolkien","description":"Bilbo Baggins, a Hobbit who just wanted to be left alone, embarks upon a dangerous journey with thirteen dwarfs and the wizard Gandalf, eventually coming into possession of a very magical ring.","publisher":"Unknown","publish_date":"2012-02-15","pages":0,"language_written":"en","img_url":"default_cover.jpg","isbn_13":"9780345340429","google_books_id":"yRqwzQEACAAJ","genre":"Baggins, Bilbo (Fictitious character)","rating":"No rating available"},{"title":"The Night Circus","author":"Erin Morgenstern","description":"In this mesmerizing debut, a competition between two magicians becomes a star-crossed love story. The circus arrives at night, without warning. No announcements precede it. It is simply there, when yesterday it was not. Within nocturnal black and white striped tents awaits a unique experience, a feast for the senses, where one can get lost in a maze of clouds, meander through a lush garden made of ice, stand awestruck as a tattooed contortionist folds herself into a small glass box, and gaze in wonderment at an illusionist performing impossible feats of magic. Welcome to Le Cirque des Rêves. Beyond the smoke and mirrors, however, a fierce competition is underway - a contest between two young magicians, Celia and Marco, who have been trained since childhood to compete in \"a game,\" in which each must use their powers of illusion to best the other. Unbeknownst to them, this game is a duel to the death, and the circus is but the stage for a remarkable battle of imagination and will.","publisher":"Doubleday Canada","publish_date":"2011-09-13","pages":401,"language_written":"en","img_url":"http://books.google.com/books/content?id=RrGFuAP-Jd8C\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026edge=curl\u0026source=gbs_api","isbn_13":"9780385671729","google_books_id":"RrGFuAP-Jd8C","genre":"Fiction","rating":4},{"title":"The Goldfinch","author":"Donna Tartt","description":"A young New Yorker grieving his mother's death is pulled into a gritty underworld of art and wealth in this “extraordinary” and beloved novel that \"connects with the heart as well as the mind\" (Stephen King, New York Times Book Review), named a New York Times Best Book of the 21st Century. Theo Decker, a 13-year-old New Yorker, miraculously survives an accident that kills his mother. Abandoned by his father, Theo is taken in by the family of a wealthy friend. Bewildered by his strange new home on Park Avenue, disturbed by schoolmates who don't know how to talk to him, and tormented above all by a longing for his mother, he clings to the one thing that reminds him of her: a small, mysteriously captivating painting that ultimately draws Theo into a wealthy and insular art community. As an adult, Theo moves silkily between the drawing rooms of the rich and the dusty labyrinth of an antiques store where he works. He is alienated and in love — and at the center of a narrowing, ever more dangerous circle. The Goldfinch is a mesmerizing, stay-up-all-night and tell-all-your-friends triumph, an old-fashioned story of loss and obsession, survival and self-invention. From the streets of New York to the dark corners of the art underworld, this \"soaring masterpiece\" examines the devastating impact of grief and the ruthless machinations of fate (Ron Charles, Washington Post).","publisher":"Little, Brown","publish_date":"2013-10-22","pages":820,"language_written":"en","img_url":"http://books.google.com/books/content?id=dvuK7isszLIC\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026edge=curl\u0026source=gbs_api","isbn_13":"9780316248679","google_books_id":"dvuK7isszLIC","genre":"Fiction","rating":4.5},{"title":"The Nightingale","author":"Kristin Hannah","description":"A REESE'S BOOK CLUB PICK A #1 New York Times bestseller, Wall Street Journal Best Book of the Year, and soon to be a major motion picture, this unforgettable novel of love and strength in the face of war has enthralled a generation. With courage, grace, and powerful insight, bestselling author Kristin Hannah captures the epic panorama of World War II and illuminates an intimate part of history seldom seen: the women's war. The Nightingale tells the stories of two sisters, separated by years and experience, by ideals, passion and circumstance, each embarking on her own dangerous path toward survival, love, and freedom in German-occupied, war-torn France—a heartbreakingly beautiful novel that celebrates the resilience of the human spirit and the durability of women. It is a novel for everyone, a novel for a lifetime. Goodreads Best Historical Novel of the Year • People's Choice Favorite Fiction Winner • #1 Indie Next Selection • A Buzzfeed and The Week Best Book of the Year","publisher":"St. Martin's Press","publish_date":"2015-02-03","pages":497,"language_written":"en","img_url":"http://books.google.com/books/content?id=0QE3BAAAQBAJ\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026edge=curl\u0026source=gbs_api","isbn_13":"9781466850606","google_books_id":"0QE3BAAAQBAJ","genre":"Fiction","rating":4.5},{"title":"The Tattooist of Auschwitz","author":"Heather Morris","description":"The incredible story of the Auschwitz-Birkenau tattooist and the woman he loved. Lale Sokolov is well-dressed, a charmer, a ladies' man. He is also a Jew. On the first transport of men from Slovakia to Auschwitz in 1942, Lale immediately stands out to his fellow prisoners. In the camp, he is looked up to, looked out for, and put to work in the privileged position of Tatowierer - the tattooist - to mark his fellow prisoners, forever. One of them is a young woman, Gita, who steals his heart at first glance. His life given new purpose, Lale does his best through the struggle and suffering to use his position for good. This story, full of beauty and hope, is based on years of interviews author Heather Morris conducted with real-life Holocaust survivor and Auschwitz-Birkenau tattooist Ludwig (Lale) Sokolov. It is heart-wrenching, illuminating, and unforgettable. 'Morris climbs into the dark miasma of war and emerges with an extraordinary tale of the power of love' - Leah Kaminsky","publisher":"Bonnier Zaffre Ltd.","publish_date":"2018-02-01","pages":244,"language_written":"en","img_url":"http://books.google.com/books/content?id=GrzIEAAAQBAJ\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026edge=curl\u0026source=gbs_api","isbn_13":"9781760403188","google_books_id":"GrzIEAAAQBAJ","genre":"Fiction","rating":"No rating available"},{"title":"The Book Thief","author":"Markus Zusak","description":"Trying to make sense of the horrors of World War II, Death relates the story of Liesel--a young German girl whose book-stealing and story-telling talents help sustain her family and the Jewish man they are hiding, as well as their neighbors.","publisher":"Alfred A. Knopf Books for Young Readers","publish_date":"2014-05-27","pages":562,"language_written":"en","img_url":"http://books.google.com/books/content?id=hIs8Sb2SLukC\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026edge=curl\u0026source=gbs_api","isbn_13":"9780375831003","google_books_id":"hIs8Sb2SLukC","genre":"Juvenile Fiction","rating":4.5},{"title":"The Help","author":"Kathryn Stockett","description":"The #1 New York Times bestselling novel and basis for the Academy Award-winning film—a timeless and universal story about the lines we abide by, and the ones we don’t—nominated as one of America’s best-loved novels by PBS’s The Great American Read. Aibileen is a black maid in 1962 Jackson, Mississippi, who’s always taken orders quietly, but lately she’s unable to hold her bitterness back. Her friend Minny has never held her tongue but now must somehow keep secrets about her employer that leave her speechless. White socialite Skeeter just graduated college. She’s full of ambition, but without a husband, she’s considered a failure. Together, these seemingly different women join together to write a tell-all book about work as a black maid in the South, that could forever alter their destinies and the life of a small town...","publisher":"Penguin","publish_date":"2011-04-05","pages":545,"language_written":"en","img_url":"http://books.google.com/books/content?id=QwBQEAAAQBAJ\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026edge=curl\u0026source=gbs_api","isbn_13":"9780425232200","google_books_id":"QwBQEAAAQBAJ","genre":"Fiction","rating":"No rating available"},{"title":"The Giver of Stars","author":"Jojo Moyes","description":"#1 NEW YORK TIMES BESTSELLER | A REESE'S BOOK CLUB PICK “A great narrative about personal strength and really captures how books bring communities together.” —Reese Witherspoon From the author of the forthcoming Someone Else’s Shoes, a breathtaking story of five extraordinary women and their remarkable journey through the mountains of Kentucky and beyond in Depression-era America Alice Wright marries handsome American Bennett Van Cleve, hoping to escape her stifling life in England. But small-town Kentucky quickly proves equally claustrophobic, especially living alongside her overbearing father-in-law. So when a call goes out for a team of women to deliver books as part of Eleanor Roosevelt’s new traveling library, Alice signs on enthusiastically. The leader, and soon Alice's greatest ally, is Margery, a smart-talking, self-sufficient woman who's never asked a man's permission for anything. They will be joined by three other singular women who become known as the Packhorse Librarians of Kentucky. What happens to them--and to the men they love--becomes an unforgettable drama of loyalty, justice, humanity, and passion. These heroic women refuse to be cowed by men or by convention. And though they face all kinds of dangers in a landscape that is at times breathtakingly beautiful, at others brutal, they’re committed to their job: bringing books to people who have never had any, arming them with facts that will change their lives. Based on a true story rooted in America’s past, The Giver of Stars is unparalleled in its scope and epic in its storytelling. Funny, heartbreaking, enthralling, it is destined to become a modern classic--a richly rewarding novel of women’s friendship, of true love, and of what happens when we reach beyond our grasp for the great beyond.","publisher":"Penguin","publish_date":"2022-02-22","pages":465,"language_written":"en","img_url":"http://books.google.com/books/content?id=dphPEAAAQBAJ\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026edge=curl\u0026source=gbs_api","isbn_13":"9780143136149","google_books_id":"dphPEAAAQBAJ","genre":"Fiction","rating":"No rating available"},{"title":"The Alice Network","author":"Kate Quinn","description":"Featuring an exclusive excerpt from Kate Quinn's next incredible historical novel, THE HUNTRESS NEW YORK TIMES \u0026 USA TODAY BESTSELLER #1 GLOBE AND MAIL HISTORICAL FICTION BESTSELLER One of NPR's Best Books of the Year! One of Bookbub's Biggest Historical Fiction Books of the Year! Reese Witherspoon Book Club Summer Reading Pick! The Girly Book Club Book of the Year! A Summer Book Pick from Good Housekeeping, Parade, Library Journal, Goodreads, Liz and Lisa, and BookBub In an enthralling new historical novel from national bestselling author Kate Quinn, two women—a female spy recruited to the real-life Alice Network in France during World War I and an unconventional American socialite searching for her cousin in 1947—are brought together in a mesmerizing story of courage and redemption. 1947. In the chaotic aftermath of World War II, American college girl Charlie St. Clair is pregnant, unmarried, and on the verge of being thrown out of her very proper family. She's also nursing a desperate hope that her beloved cousin Rose, who disappeared in Nazi-occupied France during the war, might still be alive. So when Charlie's parents banish her to Europe to have her \"little problem\" taken care of, Charlie breaks free and heads to London, determined to find out what happened to the cousin she loves like a sister. 1915. A year into the Great War, Eve Gardiner burns to join the fight against the Germans and unexpectedly gets her chance when she's recruited to work as a spy. Sent into enemy-occupied France, she's trained by the mesmerizing Lili, the \"Queen of Spies\", who manages a vast network of secret agents right under the enemy's nose. Thirty years later, haunted by the betrayal that ultimately tore apart the Alice Network, Eve spends her days drunk and secluded in her crumbling London house. Until a young American barges in uttering a name Eve hasn't heard in decades, and launches them both on a mission to find the truth...no matter where it leads. “Both funny and heartbreaking, this epic journey of two courageous women is an unforgettable tale of little-known wartime glory and sacrifice. Quinn knocks it out of the park with this spectacular book!”—Stephanie Dray, New York Times bestselling author of America's First Daughter","publisher":"HarperCollins","publish_date":"2017-06-06","pages":570,"language_written":"en","img_url":"http://books.google.com/books/content?id=dRoGDQAAQBAJ\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026edge=curl\u0026source=gbs_api","isbn_13":"9780062654205","google_books_id":"dRoGDQAAQBAJ","genre":"Fiction","rating":4},{"title":"The Orphan's Tale","author":"Pam Jenoff","description":"Look for Pam Jenoff’s new novel, The Woman with the Blue Star, an unforgettable story of courage and friendship during wartime. A New York Times bestseller! “Readers who enjoyed Kristin Hannah’s The Nightingale and Sara Gruen’s Water for Elephants will embrace this novel. “ —Library Journal “Secrets, lies, treachery, and passion…. I read this novel in a headlong rush.” —Christina Baker Kline, #1 New York Times bestselling author of Orphan Train A powerful novel of friendship set in a traveling circus during World War II, The Orphan’s Tale introduces two extraordinary women and their harrowing stories of sacrifice and survival. Sixteen-year-old Noa has been cast out in disgrace after becoming pregnant by a Nazi soldier and being forced to give up her baby. She lives above a small rail station, which she cleans in order to earn her keep… When Noa discovers a boxcar containing dozens of Jewish infants bound for a concentration camp, she is reminded of the child that was taken from her. And in a moment that will change the course of her life, she snatches one of the babies and flees into the snowy night. Noa finds refuge with a German circus, but she must learn the flying trapeze act so she can blend in undetected, spurning the resentment of the lead aerialist, Astrid. At first rivals, Noa and Astrid soon forge a powerful bond. But as the facade that protects them proves increasingly tenuous, Noa and Astrid must decide whether their friendship is enough to save one another—or if the secrets that burn between them will destroy everything. Don’t miss Pam Jenoff’s new novel, Code Name Sapphire, a riveting tale of bravery and resistance during World War II. Read these other sweeping epics from New York Times bestselling author Pam Jenoff: The Woman with the Blue Star The Lost Girls of Paris The Ambassador’s Daughter The Diplomat’s Wife The Last Summer at Chelsea Beach The Kommandant’s Girl The Winter Guest","publisher":"MIRA","publish_date":"2017-02-21","pages":378,"language_written":"en","img_url":"http://books.google.com/books/content?id=pV53DAAAQBAJ\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026edge=curl\u0026source=gbs_api","isbn_13":"9781460396421","google_books_id":"pV53DAAAQBAJ","genre":"Fiction","rating":"No rating available"},{"title":"The Paris Library","author":"Janet Skeslien Charles","description":"Based on the true World War II story of the American Library in Paris, an unforgettable novel about the power of books and the bonds of friendship—and the ordinary heroes who can be found in the most perilous times and the quietest places. Paris, 1939. Young, ambitious, and tempestuous, Odile Souchet has it all: Paul, her handsome police officer beau; Margaret, her best friend from England; Remy, her twin brother who she adores; and a dream job at the American Library in Paris, working alongside the library’s legendary director, Dorothy Reeder. When World War II breaks out, Odile stands to lose everything she holds dear—including her beloved library. After the Nazi army marches into the City of Light and declares a war on words, Odile and her fellow librarians join the Resistance with the best weapons they have: books. Again and again, they risk their lives to help their fellow Jewish readers, but by war’s end, Odile tastes the bitter sting of unspeakable betrayal. Montana, 1983. Odile’s solitary existence in gossipy small-town Montana is unexpectedly interrupted by her neighbor Lily, a lonely teenager craving adventure. As Lily uncovers more about Odile’s mysterious past, they find they share not only a love of language but also the same lethal jealousy. Odile helps Lily navigate the troubled waters of adolescence by always recommending the right book at the right time, never suspecting that Lily will be the one to help her reckon with her own terrible secret. Based on the true story of the American Library in Paris, The Paris Library is a mesmerizing and captivating novel about the people and the books that make us who we are, for good and for bad, and the courage it takes to forgive.","publisher":"Simon \u0026 Schuster","publish_date":"2021-02-02","pages":368,"language_written":"en","img_url":"http://books.google.com/books/content?id=mS8SEAAAQBAJ\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026edge=curl\u0026source=gbs_api","isbn_13":"9781982134914","google_books_id":"mS8SEAAAQBAJ","genre":"Fiction","rating":"No rating available"},{"title":"The Night Watchman","author":"Louise Erdrich","description":"It is 1953. Thomas Wazhushk is the night watchman at the first factory to open near the Turtle Mountain Reservation in rural North Dakota. He is also a prominent Chippewa Council member, trying to understand a new bill that is soon to be put before Congress. The US Government calls it an 'emancipation' bill; but it isn't about freedom - it threatens the rights of Native Americans to their land, their very identity. How can he fight this betrayal?Unlike most of the girls on the reservation, Pixie - 'Patrice' - Paranteau has no desire to wear herself down on a husband and kids. She works at the factory, earning barely enough to support her mother and brother, let alone her alcoholic father who sometimes returns home to bully her for money. But Patrice needs every penny to get if she's ever going to get to Minnesota to find her missing sister Vera. In THE NIGHT WATCHMAN multi-award winning author Louise Erdrich weaves together a story of past and future generations, of preservation and progress. She grapples with the worst and best impulses of human nature, illuminating the loves and lives, desires and ambitions of her characters with compassion, wit and intelligence.","publisher":"Corsair","publish_date":"2020-03-05","pages":464,"language_written":"en","img_url":"http://books.google.com/books/content?id=G4buxwEACAAJ\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026source=gbs_api","isbn_13":"9781472155351","google_books_id":"G4buxwEACAAJ","genre":"Fiction","rating":"No rating available"},{"title":"The Underground Railroad","author":"Colson Whitehead","description":"#1 NEW YORK TIMES BESTSELLER • PULITZER PRIZE WINNER • NATIONAL BOOK AWARD WINNER • \"An American masterpiece\" (NPR) that chronicles a young slave's adventures as she makes a desperate bid for freedom in the antebellum South. • The basis for the acclaimed original Amazon Prime Video series directed by Barry Jenkins. Cora is a slave on a cotton plantation in Georgia. An outcast even among her fellow Africans, she is on the cusp of womanhood—where greater pain awaits. And so when Caesar, a slave who has recently arrived from Virginia, urges her to join him on the Underground Railroad, she seizes the opportunity and escapes with him. In Colson Whitehead's ingenious conception, the Underground Railroad is no mere metaphor: engineers and conductors operate a secret network of actual tracks and tunnels beneath the Southern soil. Cora embarks on a harrowing flight from one state to the next, encountering, like Gulliver, strange yet familiar iterations of her own world at each stop. As Whitehead brilliantly re-creates the terrors of the antebellum era, he weaves in the saga of our nation, from the brutal abduction of Africans to the unfulfilled promises of the present day. The Underground Railroad is both the gripping tale of one woman's will to escape the horrors of bondage—and a powerful meditation on the history we all share. Look for Colson Whitehead’s new novel, Crook Manifesto, coming soon!","publisher":"Anchor","publish_date":"2018-01-30","pages":337,"language_written":"en","img_url":"http://books.google.com/books/content?id=xYtIDwAAQBAJ\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026edge=curl\u0026source=gbs_api","isbn_13":"9780345804327","google_books_id":"xYtIDwAAQBAJ","genre":"Fiction","rating":"No rating available"},{"title":"The Nickel Boys","author":"Colson Whitehead","description":"WINNER OF THE PULITZER PRIZE FOR FICTION 2020 WINNER OF THE ORWELL PRIZE FOR POLITICAL FICTION 2020 Winner of the Library of Congress Prize for American Fiction 2020 Time #1 Novel of the Year 2019 ________________________________________________________________________ Author of The Underground Railroad, Colson Whitehead brilliantly dramatizes another strand of American history through the story of two boys sentenced to a hellish reform school in 1960s Florida. Elwood Curtis has taken the words of Dr Martin Luther King to heart: he is as good as anyone. Abandoned by his parents, brought up by his loving, strict and clear-sighted grandmother, Elwood is about to enroll in the local black college. But given the time and the place, one innocent mistake is enough to destroy his future, and so Elwood arrives at The Nickel Academy, which claims to provide 'physical, intellectual and moral training' which will equip its inmates to become 'honorable and honest men'. In reality, the Nickel Academy is a chamber of horrors, where physical, emotional and sexual abuse is rife, where corrupt officials and tradesmen do a brisk trade in supplies intended for the school, and where any boy who resists is likely to disappear 'out back'. Stunned to find himself in this vicious environment, Elwood tries to hold on to Dr King's ringing assertion, 'Throw us in jail, and we will still love you.' But Elwood's fellow inmate and new friend Turner thinks Elwood is naive and worse; the world is crooked, and the only way to survive is to emulate the cruelty and cynicism of their oppressors. The tension between Elwood's idealism and Turner's skepticism leads to a decision which will have decades-long repercussions. Based on the history of a real reform school in Florida that operated for one hundred and eleven years and warped and destroyed the lives of thousands of children, The Nickel Boys is a devastating, driven narrative by a great American novelist whose work is essential to understanding the current reality of the United States. 'If greatness is excellence sustained over time, then without question, Whitehead is one of the greatest of his generation. In fact, figuring his age, acclaim, productivity and consistency, he is one of the greatest American writers alive' Time 'A commanding triumph' Sunday Times 'Every chapter hits its mark' New York Times","publisher":"Unknown","publish_date":"2019-07-16","pages":0,"language_written":"en","img_url":"http://books.google.com/books/content?id=WEOgxwEACAAJ\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026source=gbs_api","isbn_13":"9780708899427","google_books_id":"WEOgxwEACAAJ","genre":"Fiction","rating":"No rating available"},{"title":"Summary of The Silent Patient","author":"Alexander Cooper","description":"Summary of The Silent Patient - A Comprehensive Summary Chapter 1 ALICIA BERENSON WAS THIRTY-THREE YEARS OLD when she murdered her better half. I don't think enough about craftsmanship to state whether Alicia Berenson will stand the trial of time as a painter. A vehicle gathered him at 5:15 a.m. from the house he imparted to Alicia in northwest London, on the edge of Hampstead Heath, and he was headed to a shoot in Shoreditch. Alicia appeared to be negligent of the nearness of the police. At that point, something flashed in the torchlight—a blade was on the floor by Alicia's feet. Another light emission uncovered the blood splashed on Alicia's white dress. Alicia warded off the endeavors to spare her life; it took three officers to control her. As indicated by the court-selected mental medical attendant, Alicia scarcely ate or rested all she did was paint. Alicia regularly toiled weeks, even months, leaving off on another image, making unlimited outlines, orchestrating and improving the synthesis, trying different things with shading and... To be continued... Here is a Preview of What You Will Get: ⁃ A Full Book Summary ⁃ An Analysis ⁃ Fun quizzes ⁃ Quiz Answers ⁃ Etc. Get a copy of this summary and learn about the book.","publisher":"BookSummaryGr","publish_date":"2021-10-29","pages":63,"language_written":"en","img_url":"http://books.google.com/books/content?id=zllXEAAAQBAJ\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026edge=curl\u0026source=gbs_api","isbn_13":"9791220879958","google_books_id":"zllXEAAAQBAJ","genre":"Fiction","rating":"No rating available"},{"title":"The Midnight Library: A GMA Book Club Pick","author":"Matt Haig","description":"The #1 New York Times bestselling WORLDWIDE phenomenon Winner of the Goodreads Choice Award for Fiction | A Good Morning America Book Club Pick | Independent (London) Ten Best Books of the Year \"A feel-good book guaranteed to lift your spirits.\"—The Washington Post The dazzling reader-favorite about the choices that go into a life well lived, from the acclaimed author of How To Stop Time and The Comfort Book. Don’t miss Matt Haig’s latest instant New York Times besteller, The Life Impossible, available now Somewhere out beyond the edge of the universe there is a library that contains an infinite number of books, each one the story of another reality. One tells the story of your life as it is, along with another book for the other life you could have lived if you had made a different choice at any point in your life. While we all wonder how our lives might have been, what if you had the chance to go to the library and see for yourself? Would any of these other lives truly be better? In The Midnight Library, Matt Haig's enchanting blockbuster novel, Nora Seed finds herself faced with this decision. Faced with the possibility of changing her life for a new one, following a different career, undoing old breakups, realizing her dreams of becoming a glaciologist; she must search within herself as she travels through the Midnight Library to decide what is truly fulfilling in life, and what makes it worth living in the first place.","publisher":"Penguin","publish_date":"2023-05-09","pages":305,"language_written":"en","img_url":"http://books.google.com/books/content?id=ho-rEAAAQBAJ\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026edge=curl\u0026source=gbs_api","isbn_13":"9780525559498","google_books_id":"ho-rEAAAQBAJ","genre":"Fiction","rating":"No rating available"},{"title":"Summary of The Vanishing Half","author":"Alexander Cooper","description":"Summary of The Vanishing Half The Vanishing Half, published in June 2020, is the second novel by author Brit Bennett. It became a New York Times bestseller and was selected as a Good Morning America Book Club Pick. The novel explores the themes of female family bonds and the Black experience in America. Bennett covered similar material in her debut novel, The Mothers (2016), which also became a New York Times bestseller. HBO has purchased the film rights to The Vanishing Half with the intention of creating a limited TV series from the material. Page number citations in this guide refer to the Kindle edition. The novel is set in several locations during different time periods. The story begins in the small village of Mallard, Louisiana, in 1968 and then skips to New Orleans, New York, Southern California, and back to Mallard between 1978 and the early 1980s. Just as the time and location shift among numerous places and decades, the limited third-person narrative point of view shifts among multiple people. Since the novel is driven by the perceptions and recollections of its characters, the story does not move in a linear fashion. The plot concerns identical twins Desiree and Stella Vignes, who leave their small Louisiana village at the age of 16 to seek their fortune in New Orleans. Ten years later, their lives have diverged in radically different directions. Desiree has fled an abusive marriage to a Black man and brought her daughter back to Mallard, while Stella is passing for White, is married to a businessman, has a daughter with him, and lives in California. Much of the novel recounts Desiree’s search for her missing twin and how that search is completed by Desiree’s daughter. In the process, the book explores the themes of how identity is constructed, the role that self-loathing plays in creating an alternate persona, and the social ostracism visited on those who are different from the norm in some way. Here is a Preview of What You Will Get: A Full Book Summary An Analysis Fun quizzes Quiz Answers Etc Get a copy of this summary and learn about the book.","publisher":"BookSummaryGr","publish_date":"2021-03-26","pages":37,"language_written":"en","img_url":"http://books.google.com/books/content?id=uAMmEAAAQBAJ\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026edge=curl\u0026source=gbs_api","isbn_13":"9791220283526","google_books_id":"uAMmEAAAQBAJ","genre":"Fiction","rating":"No rating available"},{"title":"The Invisible Life of Addie LaRue","author":"V. E. Schwab","description":"NEW YORK TIMES BESTSELLER USA TODAY BESTSELLER NATIONAL INDIE BESTSELLER THE WASHINGTON POST BESTSELLER Recommended by Entertainment Weekly, Real Simple, NPR, Slate, and Oprah Magazine #1 Library Reads Pick—October 2020 #1 Indie Next Pick—October 2020 BOOK OF THE YEAR (2020) FINALIST—Book of The Month Club A “Best Of” Book From: Oprah Mag * CNN * Amazon * Amazon Editors * NPR * Goodreads * Bustle * PopSugar * BuzzFeed * Barnes \u0026 Noble * Kirkus Reviews * Lambda Literary * Nerdette * The Nerd Daily * Polygon * Library Reads * io9 * Smart Bitches Trashy Books * LiteraryHub * Medium * BookBub * The Mary Sue * Chicago Tribune * NY Daily News * SyFy Wire * Powells.com * Bookish * Book Riot * Library Reads Voter Favorite * In the vein of The Time Traveler’s Wife and Life After Life, The Invisible Life of Addie LaRue is New York Times bestselling author V. E. Schwab’s genre-defying tour de force. A Life No One Will Remember. A Story You Will Never Forget. France, 1714: in a moment of desperation, a young woman makes a Faustian bargain to live forever—and is cursed to be forgotten by everyone she meets. Thus begins the extraordinary life of Addie LaRue, and a dazzling adventure that will play out across centuries and continents, across history and art, as a young woman learns how far she will go to leave her mark on the world. But everything changes when, after nearly 300 years, Addie stumbles across a young man in a hidden bookstore and he remembers her name. Also by V. E. Schwab Shades of Magic A Darker Shade of Magic A Gathering of Shadows A Conjuring of Light Villains Vicious Vengeful At the Publisher's request, this title is being sold without Digital Rights Management Software (DRM) applied.","publisher":"Tor Books","publish_date":"2020-10-06","pages":484,"language_written":"en","img_url":"http://books.google.com/books/content?id=vH3LDwAAQBAJ\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026edge=curl\u0026source=gbs_api","isbn_13":"9780765387585","google_books_id":"vH3LDwAAQBAJ","genre":"Fiction","rating":5},{"title":"The Song of Achilles","author":"Madeline Miller","description":"SHORTLISTED FOR THE ORANGE PRIZE FOR FICTION 2012 Greece in the age of heroes. Patroclus, an awkward young prince, has been exiled to the court of King Peleus and his perfect son Achilles. Despite their differences, Achilles befriends the shamed prince, and as they grow into young men skilled in the arts of war and medicine, their bond blossoms into something deeper - despite the displeasure of Achilles’s mother Thetis, a cruel sea goddess. But when word comes that Helen of Sparta has been kidnapped, Achilles must go to war in distant Troy and fulfill his destiny. Torn between love and fear for his friend, Patroclus goes with him, little knowing that the years that follow will test everything they hold dear.","publisher":"A\u0026C Black","publish_date":"2012-04-12","pages":369,"language_written":"en","img_url":"http://books.google.com/books/content?id=d1jBg3VD68gC\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026edge=curl\u0026source=gbs_api","isbn_13":"9781408821985","google_books_id":"d1jBg3VD68gC","genre":"Fiction","rating":"No rating available"},{"title":"The Heart of the Matter","author":"Graham Greene","description":"“From first page to last . . . an engrossing novel” of betrayal and espionage on a colonial outpost during World War II (The New York Times). In a British colony in West Africa, Henry Scobie is a pious and righteous man of modest means enlisted with securing borders. But when he’s passed over for a promotion as commissioner of police, the humiliation hits hardest for his wife, Louise. Already oppressed by the appalling climate, frustrated in a loveless marriage, and belittled by the wives of more privileged officers, Louise wants out. Feeling responsible for her unhappiness, Henry decides against his better judgment to accept a loan from a black marketeer to secure Louise’s passage. It’s just a single indiscretion, yet for Henry it precipitates a rapid fall from grace as one moral compromise after another leads him into a web of blackmail, adultery, and murder. And for a devout man like Henry, there may be nothing left but damnation. Drawn from Graham Greene’s own experiences as a British intelligence officer in Sierra Leone, The Heart of the Matter is “a powerful, deep-striking novel . . . of a spirit lost in the darkness of the flesh” (New York Herald Tribune).","publisher":"Open Road Media","publish_date":"2018-04-10","pages":296,"language_written":"en","img_url":"http://books.google.com/books/content?id=j-BUDwAAQBAJ\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026edge=curl\u0026source=gbs_api","isbn_13":"9781504052528","google_books_id":"j-BUDwAAQBAJ","genre":"Fiction","rating":"No rating available"},{"title":"A Tale of Two Cities","author":"Charles Dickens","description":"\"It was the best of times, it was the worst of times.\" Charles Dickens' classic novel tells the story of two Englishmen--degenerate lawyer Sydney Carton and aristocrat Charles Darnay--who fall in love with the same woman in the midst of the French Revolution's blood and terror. Originally published as 31 weekly instalments,A Tale of Two Cities has been adapted several times for film, serves as a rite of passage for many students, and is one of the most famous novels ever published. This is a free digital copy of a book that has been carefully scanned by Google as part of a project to make the world's books discoverable online. To make this print edition available as an ebook, we have extracted the text using Optical Character Recognition (OCR) technology and submitted it to a review process to ensure its accuracy and legibility across different screen sizes and devices. Google is proud to partner with libraries to make this book available to readers everywhere.","publisher":"Unknown","publish_date":"1998-12-31","pages":504,"language_written":"en","img_url":"http://books.google.com/books/content?id=5EIPAAAAQAAJ\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026edge=curl\u0026source=gbs_api","isbn_13":"9788120790988","google_books_id":"5EIPAAAAQAAJ","genre":"Executions and executioners","rating":4},{"title":"The Secret History","author":"Procopius","description":"A military official and chronicler under the Eastern Roman emperor Justinian, Procopius is a key primary source for historians studying Justinian’s reign. In addition to writing a conventional history of Justinian’s wars titled History of the Wars and a panegyric to Justinian’s construction projects titled The Buildings, Procopius composed a Secret History supposedly consisting of the incidents he withheld from his previous books. In his Secret History, which was lost for centuries before it resurfaced at the Vatican Library in Rome in the 17th century, Procopius purports to unveil the celebrated Byzantine monarchs Justinian and Theodora for who they really are: corrupt, arbitrary, and literally demonic tyrants. Although considered an authentic text, its invective tone against Justinian and Theodora and its sometimes extravagant accusations (e.g. that Justinian was a demon in human form with a vanishing head) puts it in an unclear position between fiction and history. Nevertheless, the Secret History continues to be an object of study by classicists, and Procopius’s purpose for composing such a scathing text remains an object of speculation. This book is part of the Standard Ebooks project, which produces free public domain ebooks.","publisher":"Standard Ebooks","publish_date":"2023-02-21","pages":156,"language_written":"en","img_url":"http://books.google.com/books/content?id=0AavEAAAQBAJ\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026edge=curl\u0026source=gbs_api","isbn_13":"9780141037691","google_books_id":"0AavEAAAQBAJ","genre":"Classical fiction","rating":"No rating available"},{"title":"The Outsiders","author":"S. E. Hinton","description":"Over 50 years of an iconic classic! This international bestseller and inspiration for a beloved movie is a heroic story of friendship and belonging. No one ever said life was easy. But Ponyboy is pretty sure that he's got things figured out. He knows that he can count on his brothers, Darry and Sodapop. And he knows that he can count on his friends—true friends who would do anything for him, like Johnny and Two-Bit. But not on much else besides trouble with the Socs, a vicious gang of rich kids whose idea of a good time is beating up on “greasers” like Ponyboy. At least he knows what to expect—until the night someone takes things too far. The Outsiders is a dramatic and enduring work of fiction that laid the groundwork for the YA genre. S. E. Hinton's classic story of a boy who finds himself on the outskirts of regular society remains as powerful today as it was the day it was first published. \"The Outsiders transformed young-adult fiction from a genre mostly about prom queens, football players and high school crushes to one that portrayed a darker, truer world.\" —The New York Times \"Taut with tension, filled with drama.\" —The Chicago Tribune \"[A] classic coming-of-age book.\" —Philadelphia Daily News A New York Herald Tribune Best Teenage Book A Chicago Tribune Book World Spring Book Festival Honor Book An ALA Best Book for Young Adults Winner of the Massachusetts Children's Book Award","publisher":"Penguin","publish_date":"2012-05-15","pages":194,"language_written":"en","img_url":"http://books.google.com/books/content?id=ha6GIYze5lEC\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026edge=curl\u0026source=gbs_api","isbn_13":"9781101642610","google_books_id":"ha6GIYze5lEC","genre":"Young Adult Fiction","rating":4.5},{"title":"A Wrinkle in Time","author":"Madeleine L'Engle, Linda Ward Beech","description":"Meg Murry and her friends become involved with unearthly strangers and a search for Meg's father, who has disappeared while engaged in secret work for the government.","publisher":"Scholastic Inc.","publish_date":"2010-04-01","pages":20,"language_written":"en","img_url":"http://books.google.com/books/content?id=k2_JGLZhSDMC\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026edge=curl\u0026source=gbs_api","isbn_13":"9780590373609","google_books_id":"k2_JGLZhSDMC","genre":"Education","rating":4},{"title":"The Shining","author":"Stephen King","description":"#1 NEW YORK TIMES BESTSELLER • ONE OF TIME MAGAZINE'S 100 BEST MYSTERY AND THRILLER BOOKS OF ALL TIME • Before Doctor Sleep, there was The Shining, a classic of modern American horror. Jack Torrance takes a job as the caretaker of the remote Overlook Hotel. As the brutal winter sets in, the hotel's dark secrets begin to unravel. “An undisputed master of suspense and terror.” —The Washington Post Jack Torrance’s new job at the Overlook Hotel is the perfect chance for a fresh start. As the off-season caretaker at the atmospheric old hotel, he’ll have plenty of time to spend reconnecting with his family and working on his writing. But as the harsh winter weather sets in, the idyllic location feels ever more remote . . . and more sinister. And the only one to notice the strange and terrible forces gathering around the Overlook is Danny Torrance, a uniquely gifted five-year-old.","publisher":"Vintage","publish_date":"2012-06-26","pages":674,"language_written":"en","img_url":"http://books.google.com/books/content?id=c2VHVEWUFoQC\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026edge=curl\u0026source=gbs_api","isbn_13":"9780307743657","google_books_id":"c2VHVEWUFoQC","genre":"Fiction","rating":4},{"title":"Dune","author":"Frank Herbert","description":"• DUNE: PART TWO • THE MAJOR MOTION PICTURE Directed by Denis Villeneuve, screenplay by Denis Villeneuve and Jon Spaihts, based on the novel Dune by Frank Herbert • Starring Timothée Chalamet, Zendaya, Rebecca Ferguson, Josh Brolin, Austin Butler, Florence Pugh, Dave Bautista, Christopher Walken, Stephen McKinley Henderson, Léa Seydoux, with Stellan Skarsgård, with Charlotte Rampling, and Javier Bardem Frank Herbert’s classic masterpiece—a triumph of the imagination and one of the bestselling science fiction novels of all time. Set on the desert planet Arrakis, Dune is the story of Paul Atreides—who would become known as Muad'Dib—and of a great family's ambition to bring to fruition mankind's most ancient and unattainable dream. A stunning blend of adventure and mysticism, environmentalism and politics, Dune won the first Nebula Award, shared the Hugo Award, and formed the basis of what is undoubtedly the grandest epic in science fiction.","publisher":"Penguin","publish_date":"1990-09-01","pages":897,"language_written":"en","img_url":"http://books.google.com/books/content?id=nrRKDwAAQBAJ\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026edge=curl\u0026source=gbs_api","isbn_13":"9780441172719","google_books_id":"nrRKDwAAQBAJ","genre":"Fiction","rating":4},{"title":"Fahrenheit 451","author":"Ray Bradbury","description":"The hauntingly prophetic classic novel set in a not-too-distant future where books are burned by a special task force of firemen. Guy Montag is a fireman. His job is to burn books, which are forbidden, being the source of all discord and unhappiness. Even so, Montag is unhappy; there is discord in his marriage. Are books hidden in his house? The Mechanical Hound of the Fire Department, armed with a lethal hypodermic, escorted by helicopters, is ready to track down those dissidents who defy society to preserve and read books. The classic novel of a post-literate future, 'Fahrenheit 451' stands alongside Orwell's '1984' and Huxley's 'Brave New World' as a prophetic account of Western civilization's enslavement by the media, drugs and conformity. Bradbury's powerful and poetic prose combines with uncanny insight into the potential of technology to create a novel which over fifty years from first publication, still has the power to dazzle and shock.","publisher":"Createspace Independent Publishing Platform","publish_date":"2017-11-20","pages":118,"language_written":"en","img_url":"http://books.google.com/books/content?id=Zld3tAEACAAJ\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026source=gbs_api","isbn_13":"9781979899093","google_books_id":"Zld3tAEACAAJ","genre":"Fiction","rating":"No rating available"},{"title":"Ender's Game","author":"Orson Scott Card","description":"Child-hero Ender Wiggin must fight a desperate battle against a deadly alien race if mankind is to survive.","publisher":"Macmillan","publish_date":"1991-08-15","pages":252,"language_written":"en","img_url":"http://books.google.com/books/content?id=k9vI7-WwGmMC\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026edge=curl\u0026source=gbs_api","isbn_13":"9780312932084","google_books_id":"k9vI7-WwGmMC","genre":"Fiction","rating":5},{"title":"The Hunger Games","author":"Suzanne Collins","description":"First in the ground-breaking HUNGER GAMES trilogy. In a vision of the near future, a terrifying reality TV show is taking place. Twelve boys and twelve girls are forced to appear in a live event called The Hunger Games. There is only one rule: kill or be killed. But Katniss has been close to death before. For her, survival is second nature.","publisher":"Scholastic","publish_date":"2024-10-01","pages":302,"language_written":"en","img_url":"http://books.google.com/books/content?id=_zSzAwAAQBAJ\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026edge=curl\u0026source=gbs_api","isbn_13":"9781407133171","google_books_id":"_zSzAwAAQBAJ","genre":"Juvenile Fiction","rating":4},{"title":"The Girl on the Train","author":"Paula Hawkins","description":"A debut psychological thriller that will forever change the way you look at other people's lives. Rachel takes the same commuter train every morning. Every day she rattles down the track, flashes past a stretch of cozy suburban homes, and stops at the signal that allows her to daily watch the same couple breakfasting on their deck. She's even started to feel like she knows them. \"Jess and Jason,\" she calls them. Their life-as she sees it-is perfect. Not unlike the life she recently lost. And then she sees something shocking. It's only a minute until the train moves on, but it's enough. Now everything's changed. Unable to keep it to herself, Rachel offers what she knows to the police, and becomes inextricably entwined in what happens next, as well as in the lives of everyone involved. Has she done more harm than good? Compulsively readable, The Girl on the Train is an emotionally immersive, Hitchcockian thriller and an electrifying debut.","publisher":"Large Print Press","publish_date":"2016-07-12","pages":0,"language_written":"en","img_url":"http://books.google.com/books/content?id=PS9lvgEACAAJ\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026source=gbs_api","isbn_13":"9781432834357","google_books_id":"PS9lvgEACAAJ","genre":"Fiction","rating":"No rating available"},{"title":"Gone Girl","author":"Unknown","description":"No description available","publisher":"Unknown","publish_date":"2013-01-01","pages":577,"language_written":"en","img_url":"http://books.google.com/books/content?id=RoFXDwAAQBAJ\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026edge=curl\u0026source=gbs_api","isbn_13":"9781524763671","google_books_id":"RoFXDwAAQBAJ","genre":"Fiction","rating":"No rating available"},{"title":"The Fault in Our Stars","author":"John Green","description":"From John Green, the #1 bestselling author of Turtles All the Way Down \"The greatest romance story of this decade.\" --Entertainment Weekly -Millions of copies sold- #1 New York Times Bestseller #1 Wall Street Journal Bestseller #1 USA Today Bestseller #1 International Bestseller TIME Magazine's #1 Fiction Book of 2012 TODAY Book Club pick Now a Major Motion Picture Despite the tumor-shrinking medical miracle that has bought her a few years, Hazel has never been anything but terminal, her final chapter inscribed upon diagnosis. But when a gorgeous plot twist named Augustus Waters suddenly appears at Cancer Kid Support Group, Hazel's story is about to be completely rewritten. Insightful, bold, irreverent, and raw, The Fault in Our Stars brilliantly explores the funny, thrilling, and tragic business of being alive and in love.","publisher":"Penguin Books","publish_date":"2014-04-08","pages":338,"language_written":"en","img_url":"http://books.google.com/books/content?id=QiLaCwAAQBAJ\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026edge=curl\u0026source=gbs_api","isbn_13":"9780142424179","google_books_id":"QiLaCwAAQBAJ","genre":"Young Adult Fiction","rating":5},{"title":"The Kite Runner (Play Script)","author":"Matthew Spangler","description":"Coming to Broadway July 2022! The script for the stage production of Khaled Hosseini's first and internationally bestselling novel, The Kite Runner, as adapted by playwright Matthew Spangler. The unforgettable, heartbreaking story of the unlikely friendship between a wealthy boy and the son of his father's servant, The Kite Runner is a beautifully crafted novel set in a country that is in the process of being destroyed. Now adapted for the stage, the story is about the power of reading, the price of betrayal, and the possibility of redemption, and is an exploration of the influence of fathers over sons--their love, their sacrifices, their lies. A sweeping saga of family, love, and friendship told against the devastating backdrop of the history of Afghanistan over the last thirty years, The Kite Runner is an unusual and powerful story that has become a beloved, one-of-a-kind classic. This adaptation was first performed at Wyndham's Theatre, London, in December 2016.","publisher":"Penguin","publish_date":"2018-02-06","pages":146,"language_written":"en","img_url":"http://books.google.com/books/content?id=DOssDwAAQBAJ\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026edge=curl\u0026source=gbs_api","isbn_13":"9780525534464","google_books_id":"DOssDwAAQBAJ","genre":"Performing Arts","rating":"No rating available"},{"title":"The Time Traveler's Wife","author":"Audrey Niffenegger","description":"For use in schools and libraries only. Passionately in love, Clare and Henry vow to hold onto each other and their marriage as they struggle with the effects of Chrono-Displacement Disorder, a condition that casts Henry involuntarily into the world of time travel.","publisher":"Turtleback Books","publish_date":"2004-06-14","pages":546,"language_written":"en","img_url":"http://books.google.com/books/content?id=tjF9PwAACAAJ\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026source=gbs_api","isbn_13":"9781417642144","google_books_id":"tjF9PwAACAAJ","genre":"Fiction","rating":"No rating available"},{"title":"The Secret Garden","author":"Frances Hodgson Burnett","description":"The Secret Garden is a novel by Frances Hodgson Burnett first published in book form in 1911, after serialisation in The American Magazine (November 1910 August 1911). Set in England, it is one of Burnett's most popular novels and seen as a classic of English children's literature. Several stage and film adaptations have been made.","publisher":"Amila Jay","publish_date":"2022-03-15","pages":268,"language_written":"en","img_url":"http://books.google.com/books/content?id=uB7GEAAAQBAJ\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026edge=curl\u0026source=gbs_api","isbn_13":"9783985946914","google_books_id":"uB7GEAAAQBAJ","genre":"Juvenile Fiction","rating":"No rating available"},{"title":"The Hound of the Baskervilles","author":"Arthur Conan Doyle","description":"The most recent Baskerville, Sir Charles, was found dead and the footprints of a giant hound had been found near his body. Would the new heir of the Baskervilles meet the same dreadful fate?","publisher":"Signet Classics","publish_date":"1983-07-15","pages":258,"language_written":"en","img_url":"http://books.google.com/books/content?id=fgpgtHlLB0QC\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026source=gbs_api","isbn_13":"9780451524782","google_books_id":"fgpgtHlLB0QC","genre":"Fiction","rating":"No rating available"},{"title":"Dracula","author":"Bram Stoker, Jack Kelly","description":"In this retelling of the Bram Stocker classic, young Jonathan Harker first meets and then must destroy Count Dracula in order to save those closest to him.","publisher":"ABDO","publish_date":"2008-08-08","pages":244,"language_written":"en","img_url":"http://books.google.com/books/content?id=2nZ2LA5uqbQC\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026edge=curl\u0026source=gbs_api","isbn_13":"9781596792401","google_books_id":"2nZ2LA5uqbQC","genre":"Juvenile Fiction","rating":"No rating available"},{"title":"Frankenstein","author":"Mary Shelley","description":"The story of Victor Frankenstein's monstrous creation and the havoc it caused has enthralled generations of readers and inspired countless writers of horror and suspense. With the author's own 1831 introduction.","publisher":"Courier Corporation","publish_date":"2013-12-03","pages":180,"language_written":"en","img_url":"http://books.google.com/books/content?id=9xHCAgAAQBAJ\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026edge=curl\u0026source=gbs_api","isbn_13":"9780486784755","google_books_id":"9xHCAgAAQBAJ","genre":"Fiction","rating":"No rating available"},{"title":"The Wizard of Oz","author":"Lyman Frank Baum","description":"After a cyclone transports her to the land of Oz, Dorothy must seek out the great wizard in order to return to Kansas.","publisher":"Collector's Library","publish_date":"2014-07-28","pages":188,"language_written":"en","img_url":"http://books.google.com/books/content?id=hRd7dJ-9G1IC\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026edge=curl\u0026source=gbs_api","isbn_13":"9781905716524","google_books_id":"hRd7dJ-9G1IC","genre":"Fiction","rating":1},{"title":"Into the Wardrobe","author":"David C. Downing","description":"Published in the early 1950s, C. S. Lewis's seven Chronicles of Narnia were proclaimed instant children's classics and have been hailed in The Oxford Companion to Children's Literature as \"the most sustained achievement in fantasy for children by a 20th-century author.\" But how could Lewis (a formidable critic, scholar, and Christian apologist)conjure up the kind of adventures in which generations of children (and adults) take such delight? In this engaging and insightful book, C. S. Lewis expert David C. Downing invites readers to join his vivid exploration of the Chronicles of Narnia, offering a detailed look at the enchanting stories themselves and also focusing on the extraordinary intellect and imagination of the man behind the Wardrobe. Downing presents each Narnia book as its own little wardrobe - each tale an opportunity to discover a visionary world of bustling vitality, sparkling beauty, and spiritual clarity. And Downing's examination of C. S. Lewis's personal life shows how the content of these classic children's books reflects Lewis's love of wonder and story, his affection for animals and homespun things, his shrewd observations about human nature, along with his vast reading, robust humor, theological speculations, medieval scholarship, and arcane linguistic jokes. A fun glossary of odd and invented words will allow readers to speak with Narnian flair, regaling friends and family with unusual words like cantrips, poltoonery, hastilude, and skirling. A masterful work that will appeal to both new and seasoned fans of Narnia, Into the Wardrobe offers a journey beyond Narnia's deceptively simple surface and into its richly textured and unexpected depths.","publisher":"John Wiley \u0026 Sons","publish_date":"2007-06-15","pages":258,"language_written":"en","img_url":"http://books.google.com/books/content?id=C3i5el1DtVcC\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026edge=curl\u0026source=gbs_api","isbn_13":"9780787997908","google_books_id":"C3i5el1DtVcC","genre":"Social Science","rating":"No rating available"},{"title":"Harry Potter and the Sorcerer's Stone","author":"J.K. Rowling","description":"Turning the envelope over, his hand trembling, Harry saw a purple wax seal bearing a coat of arms; a lion, an eagle, a badger and a snake surrounding a large letter 'H'. Harry Potter has never even heard of Hogwarts when the letters start dropping on the doormat at number four, Privet Drive. Addressed in green ink on yellowish parchment with a purple seal, they are swiftly confiscated by his grisly aunt and uncle. Then, on Harry's eleventh birthday, a great beetle-eyed giant of a man called Rubeus Hagrid bursts in with some astonishing news: Harry Potter is a wizard, and he has a place at Hogwarts School of Witchcraft and Wizardry. An incredible adventure is about to begin! Having become classics of our time, the Harry Potter eBooks never fail to bring comfort and escapism. With their message of hope, belonging and the enduring power of truth and love, the story of the Boy Who Lived continues to delight generations of new readers.","publisher":"Pottermore Publishing","publish_date":"2015-12-08","pages":311,"language_written":"en","img_url":"http://books.google.com/books/content?id=wrOQLV6xB-wC\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026edge=curl\u0026source=gbs_api","isbn_13":"9781781100486","google_books_id":"wrOQLV6xB-wC","genre":"Juvenile Fiction","rating":4.5},{"title":"The Lion, the Witch and the Wardrobe (full color)","author":"C. S. Lewis","description":"They open a door and enter a world.","publisher":"Zondervan","publish_date":"2000-08-22","pages":212,"language_written":"en","img_url":"http://books.google.com/books/content?id=rz7J9fFShpkC\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026edge=curl\u0026source=gbs_api","isbn_13":"9780064409421","google_books_id":"rz7J9fFShpkC","genre":"Juvenile Fiction","rating":"No rating available"},{"title":"A Game of Thrones (HBO Tie-in Edition)","author":"George R. R. Martin","description":"NOW THE ACCLAIMED HBO SERIES GAME OF THRONES—THE MASTERPIECE THAT BECAME A CULTURAL PHENOMENON Here is the first book in the landmark series that has redefined imaginative fiction and become a modern masterpiece. A GAME OF THRONES In a land where summers can last decades and winters a lifetime, trouble is brewing. The cold is returning, and in the frozen wastes to the North of Winterfell, sinister and supernatural forces are massing beyond the kingdom’s protective Wall. At the center of the conflict lie the Starks of Winterfell, a family as harsh and unyielding as the land they were born to. Sweeping from a land of brutal cold to a distant summertime kingdom of epicurean plenty, here is a tale of lords and ladies, soldiers and sorcerers, assassins and bastards, who come together in a time of grim omens. Amid plots and counterplots, tragedy and betrayal, victory and terror, the fate of the Starks, their allies, and their enemies hangs perilously in the balance, as each endeavors to win that deadliest of conflicts: the game of thrones. A GAME OF THRONES • A CLASH OF KINGS • A STORM OF SWORDS • A FEAST FOR CROWS • A DANCE WITH DRAGONS","publisher":"Bantam","publish_date":"2011-03-22","pages":722,"language_written":"en","img_url":"http://books.google.com/books/content?id=hXNvadj27ekC\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026edge=curl\u0026source=gbs_api","isbn_13":"9780553386790","google_books_id":"hXNvadj27ekC","genre":"Fiction","rating":4},{"title":"The Fellowship of the Ring","author":"J. R. R. Tolkien","description":"The first volume of a three-volume epic adventure set in the fantasy world of the Third Age of Middle-earth, a world inhabited by many strange beings.","publisher":"Unknown","publish_date":"1977-10-12","pages":532,"language_written":"en","img_url":"http://books.google.com/books/content?id=ILsWC2CLZLwC\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026source=gbs_api","isbn_13":"9780345272584","google_books_id":"ILsWC2CLZLwC","genre":"Fiction","rating":"No rating available"},{"title":"The Two Towers","author":"J.R.R. Tolkien","description":"Begin your journey into Middle-earth... The inspiration for the upcoming original series on Prime Video, The Lord of the Rings: The Rings of Power. The Two Towers is the second part of J.R.R. Tolkien’s epic adventure The Lord of the Rings. One Ring to rule them all, One Ring to find them, One Ring to bring them all and in the darkness bind them. Frodo and his Companions of the Ring have been beset by danger during their quest to prevent the Ruling Ring from falling into the hands of the Dark Lord by destroying it in the Cracks of Doom. They have lost the wizard, Gandalf, in a battle in the Mines of Moria. And Boromir, seduced by the power of the Ring, tried to seize it by force. While Frodo and Sam made their escape, the rest of the company was attacked by Orcs. Now they continue the journey alone down the great River Anduin—alone, that is, save for the mysterious creeping figure that follows wherever they go. This continues the classic tale begun in The Fellowship of the Ring, which reaches its awesome climax in The Return of the King.","publisher":"HarperCollins","publish_date":"2012-02-15","pages":495,"language_written":"en","img_url":"http://books.google.com/books/content?id=12e8PJ2T7sQC\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026edge=curl\u0026source=gbs_api","isbn_13":"9780547952024","google_books_id":"12e8PJ2T7sQC","genre":"Young Adult Fiction","rating":5},{"title":"The Return of the King","author":"J. R. R. Tolkien","description":"While the evil might of the Dark Lord Sauron swarmed out to conquer all Middle-earth, Frodo and Sam struggled deep into Mordor, seat of Sauron's power. To defeat the Dark Lord, the accursed Ring of Power had to be destroyed in the fires of Mount Doom. But the way was impossibly hard, and Frodo was weakening. Weighed down by the compulsion of the ring, he began finally to despair.-Back cover.","publisher":"Unknown","publish_date":"2009-04-20","pages":436,"language_written":"en","img_url":"http://books.google.com/books/content?id=QBWbp55jP4YC\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026source=gbs_api","isbn_13":"9780007119561","google_books_id":"QBWbp55jP4YC","genre":"Fiction","rating":"No rating available"},{"title":"The Maze Runner","author":"James Dashner","description":"THE #1 NEW YORK TIMES BESTSELLING MAZE RUNNER SERIES • A teenager with no memory must navigate a deadly maze to survive in book one of this post-apocalyptic phenomenon. “[A] mysterious survival saga that passionate fans describe as a fusion of Lord of the Flies [and] The Hunger Games” (Entertainment Weekly) When Thomas wakes up in the lift, the only thing he can remember is his name. He’s surrounded by strangers—boys whose memories are also gone. Outside the towering stone walls that surround them is a limitless, ever-changing maze. It’s the only way out—and no one’s ever made it through alive. Then a girl arrives. The first girl ever. And the message she delivers is terrifying: Remember. Survive. Run. Look for more books in the blockbuster Maze Runner series: THE MAZE RUNNER • THE SCORCH TRIALS • THE DEATH CURE • THE KILL ORDER • THE FEVER CODE","publisher":"Delacorte Press","publish_date":"2009-10-06","pages":386,"language_written":"en","img_url":"http://books.google.com/books/content?id=njUmMBBedMoC\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026edge=curl\u0026source=gbs_api","isbn_13":"9780385737944","google_books_id":"njUmMBBedMoC","genre":"Young Adult Fiction","rating":5},{"title":"Divergent","author":"Veronica Roth","description":"This first book in Veronica Roth's #1 New York Times bestselling Divergent series of books is the novel the inspired the major motion picture starring Shailene Woodley, Theo James, and Kate Winslet. This dystopian series set in a futuristic Chicago has captured the hearts of millions of teen and adult readers. Perfect for fans of the Hunger Games and Maze Runner series, Divergent and its sequels, Insurgent and Allegiant, are the gripping story of a dystopian world transformed by courage, self-sacrifice, and love. Fans of the Divergent movie will find the book packed with just as much emotional depth and exhilarating action as the film, all told in beautiful, rich language. One choice can transform you. Beatrice Prior's society is divided into five factions—Candor (the honest), Abnegation (the selfless), Dauntless (the brave), Amity (the peaceful), and Erudite (the intelligent). Beatrice must choose between staying with her Abnegation family and transferring factions. Her choice will shock her community and herself. But the newly christened Tris also has a secret, one she's determined to keep hidden, because in this world, what makes you different makes you dangerous. And don't miss The Fates Divide, Veronica Roth's powerful sequel to the bestselling Carve the Mark!","publisher":"Harper Collins","publish_date":"2011-05-03","pages":419,"language_written":"en","img_url":"http://books.google.com/books/content?id=nv9lZM_0RI4C\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026edge=curl\u0026source=gbs_api","isbn_13":"9780062077011","google_books_id":"nv9lZM_0RI4C","genre":"Young Adult Fiction","rating":4.5},{"title":"The Giver","author":"Lois Lowry","description":"At the age of twelve, Jonas, a young boy from a seemingly utopian, futuristic world, is singled out to receive special training from The Giver, who alone holds the memories of the true joys and pain of life.","publisher":"Houghton Mifflin Harcourt","publish_date":"2019-02-05","pages":224,"language_written":"en","img_url":"http://books.google.com/books/content?id=hKN9xV-xl2kC\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026edge=curl\u0026source=gbs_api","isbn_13":"9780547424774","google_books_id":"hKN9xV-xl2kC","genre":"Juvenile Fiction","rating":4.5},{"title":"Ready Player One (Movie Tie-In)","author":"Ernest Cline","description":"Nominated as one of America's best-loved novels by PBS's The Great American Read The worldwide bestseller--now a major motion picture directed by Steven Spielberg. In the year 2045, reality is an ugly place. The only time teenage Wade Watts really feels alive is when he's jacked into the virtual utopia known as the OASIS. Wade's devoted his life to studying the puzzles hidden within this world's digital confines--puzzles that are based on their creator's obsession with the pop culture of decades past and that promise massive power and fortune to whoever can unlock them. But when Wade stumbles upon the first clue, he finds himself beset by players willing to kill to take this ultimate prize. The race is on, and if Wade's going to survive, he'll have to win--and confront the real world he's always been so desperate to escape.","publisher":"Ballantine Books","publish_date":"2018-01-29","pages":610,"language_written":"en","img_url":"http://books.google.com/books/content?id=WwtFDwAAQBAJ\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026edge=curl\u0026source=gbs_api","isbn_13":"9780804190145","google_books_id":"WwtFDwAAQBAJ","genre":"Fiction","rating":"No rating available"},{"title":"The Martian","author":"Andy Weir","description":"#1 NEW YORK TIMES BESTSELLER • “Brilliant . . . a celebration of human ingenuity [and] the purest example of real-science sci-fi for many years . . . utterly compelling.”—The Wall Street Journal The inspiration for the major motion picture Six days ago, astronaut Mark Watney became one of the first people to walk on Mars. Now, he’s sure he’ll be the first person to die there. After a dust storm nearly kills him and forces his crew to evacuate while thinking him dead, Mark finds himself stranded and completely alone with no way to even signal Earth that he’s alive—and even if he could get word out, his supplies would be gone long before a rescue could arrive. Chances are, though, he won’t have time to starve to death. The damaged machinery, unforgiving environment, or plain-old “human error” are much more likely to kill him first. But Mark isn’t ready to give up yet. Drawing on his ingenuity, his engineering skills—and a relentless, dogged refusal to quit—he steadfastly confronts one seemingly insurmountable obstacle after the next. Will his resourcefulness be enough to overcome the impossible odds against him? NAMED ONE OF PASTE’S BEST NOVELS OF THE DECADE “A hugely entertaining novel [that] reads like a rocket ship afire . . . Weir has fashioned in Mark Watney one of the most appealing, funny, and resourceful characters in recent fiction.”—Chicago Tribune “As gripping as they come . . . You’ll be rooting for Watney the whole way, groaning at every setback and laughing at his pitchblack humor. Utterly nail-biting and memorable.”—Financial Times","publisher":"Ballantine Books","publish_date":"2014-02-11","pages":385,"language_written":"en","img_url":"http://books.google.com/books/content?id=oGGMDQAAQBAJ\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026edge=curl\u0026source=gbs_api","isbn_13":"9780804139021","google_books_id":"oGGMDQAAQBAJ","genre":"Fiction","rating":"No rating available"},{"title":"Circe","author":"Madeline Miller","description":"Di istana Helios, dewa matahari, lahir seorang anak perempuan. Tetapi Circe anak yang aneh—tidak berkuasa seperti ayahnya, juga tidak memikat seperti ibunya. Karena tak punya teman, Circe mencarinya di dunia manusia, dan mengembangkan kemampuannya sebagai penyihir. Zeus, yang merasa terancam, mengasingkannya ke pulau terpencil. Circe mengasah bakatnya dan bertemu banyak tokoh paling termasyhur dalam mitologi, di antaranya Minotaur, Daedalus dan Icarus, Medea, dan Odysseus yang lihai. Tetapi wanita yang hanya sendirian akan menghadapi banyak bahaya, dan Circe tanpa sengaja membangkitkan murka manusia dan dewa-dewa, sehingga mesti berhadapan dengan dewa Olympus yang paling menakutkan dan pendendam. Untuk melindungi apa yang paling dicintainya, Circe harus mengerahkan seluruh kekuatannya dan memilih dengan tegas, apakah hendak berpihak kepada dewa-dewa yang telah melahirkannya, atau manusia yang telanjur disayanginya.","publisher":"Gramedia Pustaka Utama","publish_date":"2022-12-23","pages":409,"language_written":"id","img_url":"http://books.google.com/books/content?id=dyikEAAAQBAJ\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026edge=curl\u0026source=gbs_api","isbn_13":"9786020665931","google_books_id":"dyikEAAAQBAJ","genre":"Young Adult Fiction","rating":"No rating available"},{"title":"The Invisible Man","author":"Herbert George Wells","description":"In this renowned novel by H.G. Wells, a heavily disguised man takes up residence at a rural English inn and begins performing secret experiments, leading to intense curiosity from the locals. Eventually, the mysterious man, a scientist who has discovered the key to invisibility, clashes with the villagers and progressively becomes more unhinged and dangerous as he uses his powers for self-serving purposes. Published and set at the turn of the 20th century, the book highlights the perils of unchecked scientific hubris.","publisher":"Createspace Independent Publishing Platform","publish_date":"2011-01-01","pages":310,"language_written":"en","img_url":"http://books.google.com/books/content?id=vdAOAAAAIAAJ\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026edge=curl\u0026source=gbs_api","isbn_13":"9780330297851","google_books_id":"vdAOAAAAIAAJ","genre":"Fiction","rating":4},{"title":"The War of the Worlds","author":"H. G. Wells","description":"Causing mass hysteria as listeners of its 1938 radio broadcast believed a Martian invasion of Earth really was taking place, H. G. Wells' The War of the Worlds is perhaps the most famous novel of its genre. This 1898 story has spawned films, radio and television series and comic-book adaptions, and its popularity endures today.","publisher":"Unknown","publish_date":"2018-04-07","pages":108,"language_written":"en","img_url":"http://books.google.com/books/content?id=1_vwtQEACAAJ\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026source=gbs_api","isbn_13":"9781987543209","google_books_id":"1_vwtQEACAAJ","genre":"Fiction","rating":"No rating available"},{"title":"The Time Machine","author":"H. G. Wells","description":"H. G. Wells' The Time Machine, from 1895, popularized the idea of a vehicle that allows its user to travel intentionally and selectively across time, and indeed Wells is credited with coining the very term \"time machine.\" The Time Traveler of this novella tests his time machine with a leap forward to the year 802,701 A.D., to find that evolution has produced two very different post-human races - the peaceful and childlike fruit-eating Eloi and the Morlocks - pale, darkness-dwelling troglodites who operate the underground machinery that makes this seeming paradise possible.","publisher":"The Floating Press","publish_date":"2009-01-01","pages":151,"language_written":"en","img_url":"http://books.google.com/books/content?id=f3H6SMzlQQwC\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026edge=curl\u0026source=gbs_api","isbn_13":"9781877527180","google_books_id":"f3H6SMzlQQwC","genre":"Fiction","rating":"No rating available"},{"title":"The Island of Dr. Moreau","author":"H. G. Wells","description":"Ranked among the classic novels of the English language and the inspiration for several unforgettable movies, this early work of H. G. Wells was greeted in 1896 by howls of protest from reviewers, who found it horrifying and blasphemous. They wanted to know more about the wondrous possibilities of science shown in his first book, The Time Machine, not its potential for misuse and terror. In The Island of Dr. Moreau a shipwrecked gentleman named Edward Prendick, stranded on a Pacific island lorded over by the notorious Dr. Moreau, confronts dark secrets, strange creatures, and a reason to run for his life. While this riveting tale was intended to be a commentary on evolution, divine creation, and the tension between human nature and culture, modern readers familiar with genetic engineering will marvel at Wells’s prediction of the ethical issues raised by producing “smarter” human beings or bringing back extinct species. These levels of interpretation add a richness to Prendick’s adventures on Dr. Moreau’s island of lost souls without distracting from what is still a rip-roaring good read.","publisher":"National Geographic Books","publish_date":"1994-05-01","pages":0,"language_written":"en","img_url":"http://books.google.com/books/content?id=ifuNEAAAQBAJ\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026source=gbs_api","isbn_13":"9780553214321","google_books_id":"ifuNEAAAQBAJ","genre":"Fiction","rating":"No rating available"},{"title":"One Flew Over the Cuckoo's Nest","author":"Ken Kesey","description":"The inspiration for the new Netflix original series Ratched Part of the Penguin Orange Collection, a limited-run series of twelve influential and beloved American classics in a bold series design offering a modern take on the iconic Penguin paperback Winner of the 2016 AIGA + Design Observer 50 Books | 50 Covers competition For the seventieth anniversary of Penguin Classics, the Penguin Orange Collection celebrates the heritage of Penguin’s iconic book design with twelve influential American literary classics representing the breadth and diversity of the Penguin Classics library. These collectible editions are dressed in the iconic orange and white tri-band cover design, first created in 1935, while french flaps, high-quality paper, and striking cover illustrations provide the cutting-edge design treatment that is the signature of Penguin Classics Deluxe Editions today. One Flew Over the Cuckoo’s Nest Boisterous, ribald, and ultimately shattering, Ken Kesey’s One Flew Over the Cuckoo’s Nest is a seminal novel of the 1960s. Here is the unforgettable story of a mental ward and its inhabitants—a counterculture classic that inspired the 1975 film adaptation, widely considered one of the greatest movies ever made.","publisher":"Penguin","publish_date":"2016-10-18","pages":306,"language_written":"en","img_url":"http://books.google.com/books/content?id=KhRvDQAAQBAJ\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026edge=curl\u0026source=gbs_api","isbn_13":"9780143129516","google_books_id":"KhRvDQAAQBAJ","genre":"Fiction","rating":"No rating available"},{"title":"Of Mice and Men","author":"John Steinbeck","description":"A controversial tale of friendship and tragedy during the Great Depression They are an unlikely pair: George is \"small and quick and dark of face\"; Lennie, a man of tremendous size, has the mind of a young child. Yet they have formed a \"family,\" clinging together in the face of loneliness and alienation. Laborers in California's dusty vegetable fields, they hustle work when they can, living a hand-to-mouth existence. For George and Lennie have a plan: to own an acre of land and a shack they can call their own. When they land jobs on a ranch in the Salinas Valley, the fulfillment of their dream seems to be within their grasp. But even George cannot guard Lennie from the provocations of a flirtatious woman, nor predict the consequences of Lennie's unswerving obedience to the things George taught him. \"A thriller, a gripping tale . . . that you will not set down until it is finished. Steinbeck has touched the quick.\" —The New York Times","publisher":"Penguin","publish_date":"1993-09-01","pages":116,"language_written":"en","img_url":"http://books.google.com/books/content?id=YUhrILM9DOUC\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026edge=curl\u0026source=gbs_api","isbn_13":"9780140177398","google_books_id":"YUhrILM9DOUC","genre":"Fiction","rating":4.5},{"title":"East of Eden","author":"John Steinbeck","description":"A masterpiece of Biblical scope, and the magnum opus of one of America’s most enduring authors, in a commemorative hardcover edition In his journal, Nobel Prize winner John Steinbeck called East of Eden \"the first book,\" and indeed it has the primordial power and simplicity of myth. Set in the rich farmland of California's Salinas Valley, this sprawling and often brutal novel follows the intertwined destinies of two families—the Trasks and the Hamiltons—whose generations helplessly reenact the fall of Adam and Eve and the poisonous rivalry of Cain and Abel. The masterpiece of Steinbeck’s later years, East of Eden is a work in which Steinbeck created his most mesmerizing characters and explored his most enduring themes: the mystery of identity, the inexplicability of love, and the murderous consequences of love's absence. Adapted for the 1955 film directed by Elia Kazan introducing James Dean, and read by thousands as the book that brought Oprah’s Book Club back, East of Eden has remained vitally present in American culture for over half a century.","publisher":"Penguin","publish_date":"2003-06-24","pages":609,"language_written":"en","img_url":"http://books.google.com/books/content?id=1qdPEAAAQBAJ\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026edge=curl\u0026source=gbs_api","isbn_13":"9780670033041","google_books_id":"1qdPEAAAQBAJ","genre":"Fiction","rating":"No rating available"},{"title":"The House of the Spirits","author":"Isabel Allende","description":"Chilean writer Isabel Allende’s classic novel is both a richly symbolic family saga and the riveting story of an unnamed Latin American country’s turbulent history. In a triumph of magic realism, Allende constructs a spirit-ridden world and fills it with colorful and all-too-human inhabitants. The Trueba family’s passions, struggles, and secrets span three generations and a century of violent social change, culminating in a crisis that brings the proud and tyrannical patriarch and his beloved granddaughter to opposite sides of the barricades. Against a backdrop of revolution and counterrevolution, Allende brings to life a family whose private bonds of love and hatred are more complex and enduring than the political allegiances that set them at odds. The House of the Spirits not only brings another nation’s history thrillingly to life, but also makes its people’s joys and anguishes wholly our own.","publisher":"Everyman's Library","publish_date":"2005-04-19","pages":522,"language_written":"en","img_url":"http://books.google.com/books/content?id=wSlhlpIMXc0C\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026edge=curl\u0026source=gbs_api","isbn_13":"9781400043187","google_books_id":"wSlhlpIMXc0C","genre":"Fiction","rating":4}]